{
  "type": "Detailed information",
  "title": "The Free city of Argent.json",
  "content": "The Free-City of Argent: A Guide for Game Masters\n\n**Overview and First Impressions**\n\nArgent rises from the waves like a merchant's dream made stone, an island city of towers and tenements, of gleaming guildhalls and shadowed warrens, of countless peoples packed into a space that somehow contains them all. The air smells of salt and spice, of roasting meat and refuse, of exotic perfumes and the low tide reek that no city can escape. The sound is a constant roar—hawkers crying their wares, sailors shouting in a dozen languages, bells marking hours and alarms and the arrival of ships, the endless clatter of hooves and wheels on cobblestone. It is overwhelming, exhausting, and for many who arrive, the most exhilarating place they have ever known.\n\nThe city stands on an island in the Inner Sea, roughly three miles long and two miles wide at its broadest, connected to the mainland by the Great Bridge—a marvel of dwarven engineering and human ambition, a stone arch a mile long supported by piers that double as fortifications. The bridge can be raised at its midpoint,cutting off land access in times of siege, though no enemy has tested this defense in living memory. Sea approaches are guarded by the Twin Towers, massive fortifications at the harbor mouth whose beacon-fires can be seen for fifty miles and whose ballistae can sink any ship that approaches without permission.\n\n**The Districts of Argent**\n\n**The Docks** occupy the entire eastern shore, a sprawling chaos of wharves, warehouses, chandleries, and sailor's taverns that never sleep. Here goods from every nation enter the city—Imperium grain and wine, Dwarven metals and finished craft, Sylvanweald silks and enchanted goods, Cinderwaste salvage and elemental-bound artifacts, Kharakun spices and the occasional living creature best not examined too closely. The Docks are dangerous after dark, patrolled by the Harbor Watch in theory and controlled by the Dockside Guild in practice. New arrivals learn quickly which taverns serve honest ale and which serve knock-out drops, which warehouse owners pay fairly for labor and which pay in bruises. The Adventurer's Guild maintains a small office here, its job board the first stop for many seeking work.\n\n**The Artifice Quarter** lies inland from the Docks, a district of workshops, foundries, and magical laboratories where smoke and arcane residue stain the stones. Here smiths hammer steel into sword and plowshare, alchemists bubble potions in glassware salvaged from a dozen nations, enchanters scribe scrolls by candlelight, and tinkerers—mostly gnomes and goblins, but all races represented—assemble devices that may work brilliantly or explode spectacularly. The Quarter is loud at all hours, lit by forge-fire and magical glow-globes, its streets crowded with apprentices running errands and masters arguing over prices. The Spire's Licensing Office maintains a branch here, regulating the sale of restricted magical goods and testing those who claim the right to use them.\n\n**The Merchants' District** occupies the city's heart, a grid of broad avenues and solid stone buildings housing the guilds that rule Argent. The Guildhall, a massive structure of white marble and crystal windows, dominates the district's center—here the Guild Council meets, here trade disputes are arbitrated, here the laws that govern commerce are debated and enacted. Around it cluster the headquarters of individual guilds: the Merchants' Exchange with its marble columns and guarded vaults, the Bankers' Guild with its reputation for discretion and its willingness to lend at reasonable rates, the Shipwrights' Guild whose members built every vessel in the harbor, the Mercenaries' Guild where armed force can be rented by the day or the campaign. The streets here are clean, patrolled by the City Watch in polished armor, and the shops sell goods that would cost a laborer a year's wages—elven glass, dwarven clockwork, silks that change color with the wearer's mood.\n\n**The Spire** rises from the Merchants' District's northern edge, a tower of black stone that predates the city itself, built by unknown hands for unknown purposes. The mages of Argent claimed it centuries ago and have added to it since—spiral staircases that loop impossible distances, chambers that contain more space than their exterior suggests, windows that look out on vistas no map records. The Spire governs all magic within the city, licensing practitioners, regulating dangerous research, and maintaining the wards that protect Argent from magical catastrophe. Its mages are feared and resented in equal measure, but no one denies their power or their importance. Below the Spire, in its shadow, the lesser magical trades cluster—scroll-sellers, potion-merchants, diviners for hire, and those who offer to remove curses (some legitimately, some not).\n\n**The Warrens** fill the city's western third, a labyrinth of narrow streets and tall tenements where most of Argent's population lives. Here humans pack into rooms barely large enough for sleep, Beast Kin maintain communal nests in converted warehouses, tieflings cluster in blocks where they are less likely to be harassed, and the poor of every race compete for space, food, and work. The Warrens are not uniformly dangerous—whole sections are as safe as any working-class neighborhood, with community watch groups and local markets and taverns where everyone knows everyone—but they reward caution and local knowledge. Strangers who wander without purpose attract attention, and not all attention is friendly. The Warrens contain countless small temples, unofficial gambling dens, unlicensed healers, and the back entrances to businesses that prefer not to deal with guild regulations.\n\n**The Garden District** occupies the city's southern slope, where wealth and greenery combine in carefully managed harmony. Here the merchant princes and successful adventurers build their villas, surrounded by gardens that would be impossible elsewhere in Argent—imported soil, constant irrigation, gardeners whose sole purpose is to remind the wealthy of the countryside they have left behind. The district is quiet, patrolled by private guards, and largely irrelevant to those without money or connections. Its main public feature is the Temple of the Green Mother, a walled garden where anyone may walk and any may pray, though the wealthiest worshippers have private chapels and reserved meditation spaces.\n\n**The Garrison** anchors the city's northwestern corner, a fortress within the city housing the City Watch headquarters, the harbor defense command, and the barracks of the standing force that maintains order when guild disputes threaten to spiral into street warfare. The Garrison's commander, appointed by the Guild Council but confirmed by popular vote, holds one of the most powerful positions in Argent—who controls the Watch controls the streets, and the streets have decided many a close Council election. The fortress is open to the public only on specified days, its walls thick enough to withstand siege, its dungeons deep enough to hold anyone the Council deems dangerous.\n\n**Surroundings and Approaches**\n\nThe island's mainland side faces the fertile coastal plain called the Argent Marches, farmlands that supply much of the city's food. Small towns and villages dot the plain—Granthill, Rivermouth, Millford—each exporting its produce across the Great Bridge and importing the city's manufactured goods in return. These settlements are safer than the open country, patrolled by the March Watch, but bandits occasionally raid from the hills to the north, and the Cinderwaste's eastern edge lies only a week's ride away.\n\nThe sea approaches offer their own dangers. Pirates operate from hidden coves along the coast, preying on ships that stray from convoy routes. Sea serpents, though rare, occasionally surface near shipping lanes, and the Drowned God's clergy claim this is no accident. Storms can rise with terrifying speed on the Inner Sea, and even the best ships sometimes founder within sight of the Twin Towers' beacon.\n\n**Key Institutions**\n\n**The Guild Council** governs Argent through a system of weighted votes—each guild casts votes proportional to its tax contribution, a system that ensures the wealthy rule but also ensures that sudden shifts in wealth can shift power. The Council meets weekly in the Guildhall, its debates open to the public (in theory) and its decisions binding on all citizens. The current balance tilts toward the Merchants and Bankers, with the Shipwrights holding swing votes and the smaller guilds scrambling for influence.\n\n**The Exchange** functions as bank, treasury, and information clearinghouse. Its vaults hold the reserves that back Argent's currency; its ledgers track debts between nations; its information service sells verified news to those who can pay. The Exchange's masters know more about the world's financial flows than any spymaster, and they sell this knowledge carefully, never enough to shift a market too far, always enough to profit.\n\n**The Spire's Council of Nine** governs magical practice in Argent, its members chosen by the mages themselves and confirmed by the Guild Council. They license practitioners, arbitrate magical disputes, and maintain the city's wards—complex enchantments woven into the very stone that absorb stray magic, prevent uncontrolled summoning, and alert the Spire to catastrophic spellcasting anywhere in the city. Their authority is absolute within their domain, and even the Guild Council hesitates to challenge them.\n\n**The Adventurer's Guild** maintains the job board, registers contracts, and provides a social space for those who make their living through danger. Its hall near the Docks offers cheap meals, basic medical care, and a place to sleep for members in good standing. The Guild takes ten percent of all contracts, a fee that funds its operations and its network of informants who track which jobs are real and which are traps.\n\n**The Temple District** clusters around the Garden District's edges, a collection of shrines and temples serving every major faith. Solaris's Sun Temple blazes with captured daylight; the Green Mother's garden offers peace to all; the Silent Father's shrine accepts the dying without question; small temples to Nethys, the Twins, the Traveler, and a dozen minor deities compete for worshippers and donations. The Dusk Elves maintain a small, discreet shrine to the Lady of Secrets, and rumors persist of hidden temples to darker powers in the Warrens' depths.\n\n**Mood and Atmosphere**\n\nArgent is a city of contradictions—wealth and poverty within sight of each other, order and chaos separated by a single street, opportunity and danger offered in equal measure. Its citizens are proud of their city's independence, of its ability to hold its own against the great powers, of its reputation as the place where anyone can rise and anyone can fall. They are also cynical, world-weary, and deeply suspicious of anything that sounds too good to be true—because in Argent, it probably is.\n\nThe rhythm of the city follows the tide. Morning brings the fishing fleet out and the market stalls opening; noon sees the streets crowded with business; evening brings the taverns to life and the Watch to alertness; night belongs to those who move in shadows, to the thieves and the desperate and the merely nocturnal. The bells mark each hour, and the Spire's beacon sweeps the sky, and somewhere in the Warrens a child is born while somewhere in the Merchants' District a deal is signed that will shape the next decade's trade.\n\nFor the Game Master, Argent offers a thousand adventure hooks in every district. The Docks need protection from pirates; the Artifice Quarter needs someone to test a dangerous new invention; the Warrens need someone to find a missing child; the Merchants' District needs someone to deliver a message that cannot be trusted to ordinary means; the Spire needs someone to investigate magical anomalies that may or may not threaten the city. Every faction has agents here, every nation maintains spies here, every secret eventually passes through here. Argent is not the center of the world—but from Argent, you can see the center of everything, and that is enough."
}