{
  "type": "Main information",
  "title": "The Pantheons of Aethelgard",
  "content": "The Pantheons of Aethelgard: Gods and Demons\n\nAbove the mortal realm, beyond the reach of the Weave and the Pulse's raw song, the gods dwell in domains that mortals can only glimpse in visions and fever dreams. They are not distant in the sense of being absent—they are woven into the fabric of existence as the weft is woven into warp, their influence felt in every answered prayer, every stroke of luck, every moment of inexplicable courage or crushing despair. The gods of Aethelgard do not walk the world as mortals do (At least most of the time, though from time to time they may temporarily descend from Chorus to live a mortal life and return back once they are satisfied), save in the rare and terrible instances of incarnation, but they reach into it through the Chorus—the divine distribution of power that flows from the Pulse through their filtered grace to clerics, paladins, and faithful who call upon their names.\n\nThe relationship between gods and mortals is one of reciprocal need, though the gods would never admit it. Mortals require divine protection, guidance, and the miracles that only faith can channel. The gods require worship, for belief is the currency that maintains their influence and perhaps their very existence. A god with no worshippers does not die—nothing so simple—but fades, becoming a whisper, a half-remembered dream, until some desperate soul rediscovers their name and the cycle begins again. This symbiosis shapes both parties: gods compete for followers through miracles and omens, and mortals choose their deities based on culture, need, or the compelling nature of divine promises.\n\nManifestation takes many forms. The most common is the answered prayer—a soldier finding impossible strength in battle, a sailor surviving a storm that should have drowned them, a healer's hands glowing with light that closes wounds. More direct are omens: the flight of birds spelling warnings, the pattern of entrails revealing future victories, the sudden bloom of flowers on a grave. Rarest are avatars, moments when a god compresses enough of their essence into mortal form to walk among their followers. These avatars are not the god entire—that would shatter the vessel—but a fragment, a dream of divinity made flesh, and they fade when their purpose is fulfilled or when the mortal frame can no longer contain them. Demons manifest differently, sliding through cracks in reality's walls, possessing the desperate or the damned, or simply appearing in places where suffering has thinned the boundary between worlds.\n\n**The High Pantheon: Gods of the Great Nations**\n\n**Solaris, the Dawn-Father** reigns as chief deity of the Solar Imperium, though chief is a mortal concept he neither confirms nor denies. He is the god of ambition, progress, rightful rule, and the sun's purifying light. His domain, the Golden Hall, rises at the point where dawn first touches the world, and from there he watches his chosen people with pride and disappointment in equal measure—pride in their achievements, disappointment that they still fall so short of his vision. He appears in art as a towering human man with skin of molten gold, eyes like miniature suns, and a spear that is literally the first ray of morning. His clerics, the Sun-Priests, hold enormous influence in Luminas, advising the Synod and consecrating new legions before they march. His paladins, the Dawnwardens, are the Imperium's most feared holy warriors, their swords blazing with captured light. He demands ambition, discipline, and the spread of civilization; he forbids despair, for to despair is to deny the certainty of tomorrow's sun.\n\n**Nethys of the Two Eyes** holds dominion over magic, knowledge, and the dangerous space between understanding and madness. His worshippers are found everywhere, for what mage does not seek deeper wisdom? Yet his temples are rare, for Nethys teaches that truth is found alone, in the dark hours when comfort falls away. He is depicted as a figure split down the middle—one half serene and beautiful, the other twisted and weeping, for he sees all magic's potential for creation and destruction simultaneously. His clerics, the Eyes of Nethys, serve as advisors to magical colleges across the world, though they take no side in political disputes. His oracles, the Seers of the Split, are sought for prophecies that are always accurate and always ambiguous, leaving mortals to choose which interpretation to follow. Nethys favours those who seek knowledge regardless of consequence; he abandons those who use magic without understanding its cost.\n\n**Moradin, the Forgemaster** shapes the souls of dwarves on his anvil of stars, each one hammered from raw essence and cooled in the tears of the world's first mountain. He is god of craft, clan, endurance, and the sacred duty of memory. His domain, the Hall of Making, exists at the core of every mountain and none—a paradox dwarven theologians accept without question. He appears as a dwarf of such immense age that his beard flows like molten metal and his eyes are chips of raw mithril. His clerics, the Anvil-Priests, tend the great forges of the Hegemony, blessing each new rune and each newborn child. His paladins, the Hearth-Guardians, defend holds with stubborn fury, for they know that every dwarf lost is a song silenced forever. Moradin demands craftsmanship, honour, and the keeping of oaths; he turns his face from those who waste good metal or forget their ancestors' names.\n\n**The Green Mother** is not a single goddess but a title borne by different aspects across different forests. In the Sylvanweald, she is Silvana, the Root-Queen, ancient and patient, her skin bark and her hair leaves, her voice the rustle of branches in a storm. Among the Halfling Kith, she is Hestia of the Hearth-Fire, smaller and warmer, her domain the cooking fire and the storytelling circle and the field planted with next year's bread. In the Cinderwaste's rare oases, she is Ashaya, the Survivor, grey-skinned and tough, her miracles coaxing life from poisoned soil. All are the same goddess wearing different masks, for the Green Mother adapts to those who need her. She is goddess of growth, home, nature's bounty, and the stubborn refusal to die. Her druids and rangers are found in every land, protecting wild places and teaching mortals to live within natural limits. Her clerics tend the sick and bless the harvests, and her paladins—rare, for she prefers defence to aggression—guard sacred groves and ancient trees with patient ferocity. She demands respect for the cycle of life and death; she abhors those who take more than they need or poison the earth for gain.\n\n**The Drowned God** sleeps beneath the Inner Sea, his domain the crushing depths where light never reaches and pressure would reduce mortal bones to paste. His name is spoken only in whispers, for to say it too loudly is to invite his attention, and his attention is not gentle. He is god of the deep, of what is lost and never found, of the patience that outlasts continents. Sailors make offerings to him before long voyages—not for his favour, which is never given, but for his indifference, which is the best they can hope for. His rare clergy, the Depth-Priests, dwell in coastal caves where the tide reaches twice daily, and they speak in the language of drowning men. They know secrets of sunken cities and treasures lost for millennia, but they also know that the Drowned God does not give up what he takes. He has no paladins, for his service is not a warrior's calling; he has only those who listen to the sea and understand that everything, eventually, returns to the deep.\n\n**The Twins of War** are inseparable and irreconcilable: Vorn, the Red, god of battle-fury, and Myria, the Grey, goddess of strategy. Vorn appears as a berserker with blood-soaked axe and eyes that see only the next enemy; Myria as a hooded figure studying maps carved from bone. Both claim the same domain—war—but approach it from opposite poles, and their followers have clashed as often as united. Vorn's clerics inspire troops with battle-chants that blur into madness; his paladins, the Red Legion, charge first and ask questions never. Myria's strategists advise generals on troop movements and supply lines; her Grey Wardens fight with cold precision, each kill calculated, each movement planned. Nations pray to both before conflict—to Vorn for fury, to Myria for victory—and after battle, they honour both, for the Twins are jealous and easily slighted. Vorn demands courage and the willingness to die; Myria demands cunning and the willingness to let others die for the greater plan.\n\n**The Lady of Secrets** holds dominion over shadow, whispers, and the truths that destroy. She is the primary deity of the Dusk Elves, though she accepts worshippers from any race willing to walk her shadowed path. Her domain, the Veil, exists between light and dark, between sleep and waking, between the word spoken and the word heard. She appears as a woman whose face is never quite visible, whose voice echoes slightly, as if she speaks from the bottom of a well. Her priestesses, the Veil-Tenders, serve as the Glimmerdark's spiritual leaders, interpreting her dreams and guiding the theocracy's policies. Her assassins, the Silent Sisters, are the most feared killers in Aethelgard, for they kill not with poison or blade but with secrets—the revelation that destroys a marriage, the truth that topples a government, the whispered doubt that drives a general to suicide. The Lady demands that her followers seek what is hidden and guard what they find; she abandons those who speak truth carelessly or sell secrets to both sides without ensuring neither wins.\n\n**The Traveler** has no fixed form, no single temple, no organized clergy—and that is precisely how he prefers it. He is god of roads, chance encounters, border crossings, and the moments when life pivots on a decision made in an instant. He appears as a stranger on the road who offers advice that proves invaluable, as a sudden storm that forces travellers to shelter together and change each other's fates, as the coin that lands on its edge and decides nothing. His followers are not organized; they are simply those who recognize his hand in their lives and offer small tributes—a coin left at a crossroads, a story shared with a stranger, a door left unlocked for one night. Halflings honour him most, for their lives are built on movement and happy accidents, but he claims devotees in every nation. He demands nothing but awareness—that mortals notice the forks in their paths and choose consciously. He offers nothing but possibility, which is either everything or nothing, depending on who receives it.\n\n**The Silent Father** rules the domain of death, but not as mortals fear it. He is not the ending but the transition, the guide who meets souls at the moment of passing and leads them to whatever waits beyond. His domain, the Grey March, is neither paradise nor punishment—it is simply the path, and all souls walk it eventually. He appears as whatever the dying most need to see: a parent, a beloved teacher, a trusted friend, or simply a hooded figure whose face brings peace. His clergy, the Silent Brothers and Sisters, tend to the dying and the grieving, offering comfort without doctrine, for the Silent Father teaches that death needs no explanation—only acceptance. His paladins, the Grey Vigil, protect graveyards and funeral processions, ensuring that the dead reach their rest undisturbed. He has no enemies among the gods, for even they must eventually face what lies beyond; he has no favourites, for death comes to all equally. He demands only that mortals face their ending with dignity; he offers the certainty that no one faces it alone.\n\n**The Demon Princes: Powers of Corruption and Ruin**\n\nWhere gods draw power from worship and offer blessings in return, demons are not sustained by faith but by suffering, chaos, and the slow corrosion of order. They are not fallen gods, for they were never divine in that sense; they are older, stranger, born from the Pulse's nightmares or from wounds in reality's fabric that never healed. They do not seek worshippers—they seek playthings, instruments, fuel for their incomprehensible purposes. Those who serve them do so not out of love but out of desperation, ambition, or the slow corruption that begins with a single small compromise.\n\n**Xalgoroth, the Whisper in the Walls** is not the most powerful of demon princes but the most insidious. He has no physical form, no lair, no army of lesser demons. He is simply a voice that speaks in the minds of the isolated, the ambitious, the resentful—suggesting, never commanding, offering solutions that seem reasonable until they are irreversible. A guild member overlooked for promotion hears that his rival's forge could accidentally collapse; a spurned lover hears that a simple poison would ease the pain; a king afraid of assassination hears that executing suspected traitors preemptively would secure his throne. Xalgoroth does not lie—he simply shows the path, and mortals walk it themselves. His followers are not cultists but individuals, each believing their choices were their own, each contributing to the slow rot Xalgoroth feeds upon. No temple honours him, no cleric prays to him; he is simply there, in the quiet moments when conscience whispers and ambition shouts louder.\n\n**Vashna, the Scarlet Queen** rules a domain of blood and battle, but unlike Vorn the Red, she offers no glory—only endless, pointless slaughter. Her realm, the Crimson Fields, is an infinite plain where armies fight forever, dying and reforming to fight again, their screams the only music. She appears as a warrior of terrifying beauty, her armour made from the fused faces of those who died screaming her name. Her cults arise wherever war becomes meaningless—in sieges that have lasted so long no one remembers why, in border skirmishes that serve no strategic purpose, in civil wars where brother kills brother for reasons lost to time. Her followers are not soldiers but addicts of violence, those for whom peace feels like death. She grants them strength beyond reason, wounds that do not bleed, and the absolute certainty that killing is the only answer. Her priests, the Blood-Tongues, wander battlefields whispering to the wounded that they should not seek healing, should not surrender, should fight until nothing remains—for in nothing, the Scarlet Queen promises, they will find peace.\n\n**Malagar, the Hoarder of Names** dwells in a labyrinth beneath reality, its walls made from the memories he has stolen. He is demon of secrets, but not in the Lady's sense—she guards secrets as treasures; he consumes them as fuel. He appears as a figure with too many eyes and too many mouths, each mouth whispering a different stolen truth, each eye reflecting a different ruined life. His cults attract those who cannot bear their own histories—the guilt-ridden, the ashamed, those who would trade anything to forget. Malagar offers forgetfulness, but his price is the memory itself, which he adds to his walls, and with it goes a piece of the supplicant's identity. His most powerful servants are the Hollow Ones, men and women who have traded so many memories that nothing remains but their bodies and their loyalty to him. They serve as his agents in the world, stealing memories from others to feed their master, slowly becoming more labyrinth than person.\n\n**The Burning Lord** has no true name, for names imply identity and he is pure destruction—fire without purpose, heat without warmth, the joy of annihilation. He appears as a column of flame in the shape of a man, his face a mask of ecstatic agony, his touch turning everything to ash. His cults arise in desperate times, among those who have lost everything and see no reason for anything to remain. They are arsonists, saboteurs, nihilists who believe that only in universal destruction can they find peace. Unlike Xalgoroth's subtle corruption or Vashna's bloody addiction, the Burning Lord's followers are openly mad, their eyes holding the reflection of flames that never cool. They are hunted relentlessly in every nation, for they cannot be bargained with, cannot be reasoned with, cannot be stopped except by death—and some of them welcome even that, as just another fire.\n\n**The Weeping King** was once mortal, or so the stories say—a ruler who loved his people so much that when they died in plague, he could not let them go. He sought out every dark art, made every terrible bargain, and finally found a demon who promised to preserve his kingdom forever. The demon kept its word: the kingdom still exists, its people still walk its streets, but they are preserved as they were in death, their eyes open and staring, their flesh cold, their voices silent. The Weeping King rules them still, weeping eternally in his frozen palace, unable to die and unable to forget. He is demon now, or something like demon, and his influence spreads through grief too deep to heal. His cults attract those who cannot accept loss—parents who have buried children, lovers who have outlived their beloveds, kings who would rather doom their people than see them change. He offers the gift of stasis, of preservation, of never having to say goodbye. His followers learn, too late, that a love that cannot end is also a love that cannot grow.\n\n**The Forgotten** are not a single demon but a category—entities so ancient, so alien, that they have no names because no mortal has ever learned them. They dwell in the spaces between stars, in the lightless trenches of the deepest oceans, in the moments between heartbeats when the Pulse skips. They do not seek worshippers, do not answer prayers, do not notice mortals at all except as occasional irritations or amusements. To encounter one is to be annihilated not by malice but by incomprehension, as a human might accidentally step on an ant without noticing. Their rare cultists do not worship them so much as study them, hoping to attract their attention, to be noticed by something so vast that notice alone would be transcendence. These cultists are the most dangerous of all, for their rituals sometimes work—and when the Forgotten notice something, they do not always distinguish between the one who called them and everything else in the vicinity.\n\n**The Balance: Divine and Infernal in the World**\n\nBetween gods and demons, the mortal realm exists as a battlefield and a garden simultaneously. The gods offer purpose, community, and the hope that actions have meaning beyond the grave. The demons offer power without responsibility, oblivion without pain, the seduction of easy answers to impossible questions. Most mortals choose the gods, or choose nothing, living their lives without extreme devotion or damnation. But the extremes shape the world out of proportion to their numbers—a single cleric channeling divine wrath can turn a battle; a single demon-cultist can poison a city's water and doom thousands.\n\nThe great nations manage this tension through institutional religion. The Solar Imperium sponsors temples to Solaris and suppresses cults to the Burning Lord with equal vigour. The Sylvanweald integrates worship of the Green Mother into daily life while quietly executing any who show interest in the Whisper in the Walls. The Federation of Cinders, pragmatic as always, permits any worship that does not harm others, reasoning that desperate souls will find darkness anyway and are better monitored in the open. The Glimmerdark's theocracy to the Lady of Secrets treats other gods as useful fictions and other demons as rivals to be eliminated.\n\nAnd beneath all, in the quiet places where prayers are whispered and bargains made, the gods watch and the demons wait. The Pulse beats on, indifferent to both, and the world turns through another day toward whatever future the choices of mortals and immortals together will weave."
}