{
  "type": "Main information",
  "title": "The Ancient History of Aethelgard",
  "content": "The Ancient History of Aethelgard: From Dragons to the Age of Mortals\n\n**The First Age: The Reign of Dragons**\n\nBefore the elves carved the first rune, before the dwarves lit the first forge, before any mortal drew breath, the dragons ruled Aethelgard. They came from the Pulse itself, born in the world's first fire, when the continents were still cooling and the seas had not yet found their shores. The great wyrms were not numerous even then—they are singularities, not a species—but each was a power unto themselves, shaping the world according to their natures. The golden dragons raised mountains where they slept; the red dragons carved valleys with their passing; the silver dragons taught the winds to sing; the black dragons breathed corruption into places that remain poisoned to this day.\n\nFor millennia beyond counting, the dragons were the only intelligent life on Aethelgard. They warred among themselves, allied when it suited them, ignored each other when it did not. They built no cities, for they needed none; they left no ruins, for their passing was destruction enough. They simply were, and the world was theirs, and they asked nothing of it but room to fly and fire to breathe and the endless patience of those who measure time in continental drift.\n\nThen something changed. The Pulse, which had been stable since the world's birth, began to quicken. New forms of life emerged—not dragons, not beasts, but something between. The elves would later call this the Dawning, the moment when the Pulse first expressed itself through mortal minds. The dragons, who had never considered that anything else might matter, barely noticed. They would not notice for thousands of years more, and by then it would be too late.\n\n**The Second Age: The Awakening of the Elves**\n\nThe elves were the first mortals to shape the Pulse consciously. In the deep forests of what would become the Sylvanweald, among the ancient trees that had stood since before the dragons noticed the land, the first elven minds began to perceive the Pulse not as background hum but as something they could touch, could influence, could weave into patterns that persisted beyond the moment of weaving. They called this the Weave, and they taught it to their children, and over generations they built the first magical civilization the world had ever known.\n\nThe elves did not spread across the world as later races would. They found their forests sufficient, their slow lives fulfilling, their magic deepening with each century of study. They watched the dragons with distant curiosity, noting that the great wyrms seemed to regard them as briefly as they regarded clouds or trees. They developed their philosophy of patience, their conviction that time was a river and they were the stones in it, enduring while everything else flowed past. The Dusk Elves had not yet split from their kin; all elves were one people then, united in their slow contemplation of eternity.\n\nBut even elves could not remain unchanged forever. Some grew restless with the endless patience, curious about the darkness beneath the mountains, the shadows that the sun never touched. They began to study the Pulse in a different way—not its flow but its absence, not its light but its edges. The Sundering came, gentle by mortal standards but absolute by elven ones. The Dusk Elves descended into the Glimmerdark, and the Sylvanweald closed its borders, and the two peoples began their long divergence into light and shadow.\n\n**The Third Age: The Children of Earth and Stone**\n\nWhile the elves wove magic in their forests, other races were awakening in places the elves had never thought to explore. Deep beneath the Ironvein Mountains, the dwarves emerged from stone as if the mountains themselves had given birth. They did not find magic; they forged it, hammering the Pulse into permanence, carving runes that would outlast their creators. They built the first holds, the first cities that deserved the name, and they filled them with craft that would shame later generations. The dwarves spread slowly, for they built in stone and stone takes time, but they spread thoroughly—every mountain range in Old Aethelgard eventually held dwarven halls, and the dwarves assumed this was simply how the world worked.\n\nIn the valleys and plains, the halflings appeared as quietly as morning dew. No one knows their true origin—they claim they have always been there, always wandering, always just beyond the next hill. They built no cities, sought no dominion, simply followed the herds and the seasons and the strange intuition that told them where the best stories would be found. Their magic, Hearth and Happenstance, was so subtle that other races did not recognize it as magic at all. The halflings were content with this. They had each other, and good food, and the open road. What more could anyone need?\n\nThe Beast Kin emerged gradually, not as a single race but as countless variations on a theme. Animals touched by concentrated Pulse gained intelligence, gained self-awareness, gained the ability to speak and think and choose. Over generations, these touched animals bred true, producing lineages that were neither beast nor mortal but something between. The Feline Kin claimed the savannahs and forests, the Canine Kin the plains and pack-territories, the Cervid and Vulpine Kin the woodlands and thresholds, the Avian Kin the heights, the Ursine Kin the deep woods and mountains, the Reptilian Kin the hot places, the Bat and Arachnid Kin the dark places. They did not build civilizations in the manner of elves or dwarves; they integrated into the ecosystems they had evolved from, finding their places in the world's great web.\n\n**The Fourth Age: The Pacts That Forged a People**\n\nThe Tieflings were not born; they were made. In the centuries after the elves had mastered the Weave and the dwarves had perfected the Sigil, certain mortals of various races grew ambitious beyond wisdom. They sought power that the established traditions could not provide—power from beyond the world, from the spaces between pulses, from entities that had never been mortal and never would be. They made pacts with demons, with elemental princes, with things that had no names. They bargained away pieces of themselves for power that came instantly, without study, without patience, without cost—until the cost came due.\n\nThe pacts were not forgotten. The blood remembered. Children born to those who had bargained carried marks of their parents' choices—horns, tails, skin of impossible colors, eyes that held too much knowing. Over generations, these marked ones found each other, for they were unwelcome among their parent races, reminders of bargains everyone wished to forget. They intermarried, produced more marked children, and slowly became a people unto themselves. The Tieflings did not choose to exist; they were chosen by the ambitions of their ancestors. But they chose, in turn, to survive, to thrive, to carve a place in a world that had not asked for them and did not want them.\n\n**The Fifth Age: The Coming of Humans**\n\nThe youngest race arrived last, and they arrived with nothing. No innate magic, no ancient traditions, no place in the world's established order. The humans appeared in scattered groups across the continent—some say the Pulse itself gave birth to them, an experiment by the world in what life might become without the constraints of elder memory. Others say they migrated from some distant land, carrying only the clothes on their backs and the desperate adaptability of those who have nothing to lose. Whatever their origin, they spread across Aethelgard like fire across dry grass.\n\nThe elder races watched with bemused tolerance as these short-lived creatures multiplied, built villages, learned languages, imitated customs. They assumed humans would burn out as quickly as they had appeared, their brief lives producing nothing of lasting value. They were wrong. Humans learned the Weave from elves—not as well, not as deeply, but with a hunger that elves had never felt. They learned the Sigil from dwarves—not as permanently, not as reliably, but with an ingenuity that turned dwarven methods to new purposes. They learned storytelling from halflings and survival from Beast Kin and the hard lessons of prejudice from everyone.\n\nAnd they bred. Humans bred with elves, producing half-elves who lived longer than humans and thought faster than elves. They bred with dwarves, producing half-dwarves who carried the craft of their fathers and the ambition of their mothers. They bred with orcs and tieflings and even, rarely, with Beast Kin, producing hybrids that defied every category. The elder races found this disturbing, then alarming, then simply inevitable. Humans would not be contained, would not be dismissed, would not stay in the places assigned to them.\n\n**The Age of Mortals: The World as It Is**\n\nBy the time the dragons noticed that the world had filled with mortal races, it was too late to do anything about it. The great wyrms retreated to their lairs, to their hoards, to their ancient patience, waiting for these mayflies to burn out as all mayflies eventually did. But the mayflies did not burn out. They built cities, forged empires, discovered magic that could challenge even dragons. They fought wars among themselves, forgot their lessons, learned them again. They spread across every continent, adapted to every climate, filled every niche that the world offered.\n\nThe Cataclysm, a century ago, was the first true test of whether mortals could survive their own power. It came closer to ending civilization than any dragon ever had. But mortals survived—crippled, scarred, changed, but alive. They signed the Starfall Accord, established the Order of the Silent Vigil, built the fragile peace that still holds. And they kept breeding, kept adapting, kept proving that the youngest race and its companions would not be so easily dismissed.\n\nThe dragons still wait, patient in their lairs, certain that time will eventually prove them right. The elves still watch from their forests, certain that patience will eventually prove them wise. The dwarves still forge in their mountains, certain that craft will eventually prove them indispensable. The halflings still wander, certain that home is not a place but a people. The Beast Kin still run with their tribes, certain that instinct knows what reason forgets. The tieflings still carry their ancestors' bargains, certain that survival justifies any origin.\n\nAnd the humans—the youngest, the hungriest, the most dangerous—keep spreading, keep adapting, keep proving that a race with nothing to lose and everything to gain will eventually reshape the world in its image. The Pulse beats on, indifferent to all, and the story continues, written in blood and magic and the endless ambition of those who refuse to stay in the places assigned to them."
}