{
  "type": "Detailed information",
  "title": "The Adventurer's Guild.json",
  "content": "The Adventurer's Guild of Aethelgard: A Guide for Game Masters\n\n**Origins and Purpose**\n\nThe Adventurer's Guild began centuries ago as a simple solution to a common problem: people needed help, and people needed work, and no reliable system existed to connect them. A retired mercenary captain in Argent, whose name has been lost to time, began keeping a list of jobs on a board outside his tavern—guard duty here, monster problem there, someone's missing child needing finding. The idea spread. Other cities copied it. And slowly, over generations, what had been informal became institutional, until the Adventurer's Guild emerged as one of the largest and most trusted organizations in all Aethelgard.\n\nToday, the Guild maintains towers in every major city of Old Aethelgard—Luminas, Khaz-Vorn, Emberhold, the Sylvanweald's few trading posts, and of course Argent, where its headquarters still stands near the Docks. Its purpose remains what it always was: to connect those who need doing with those who can do, to ensure fair dealing on both sides, and to provide a framework within which adventurers can build careers without being cheated, killed, or arrested for crimes they didn't commit.\n\n**The Quest System**\n\nAt the heart of the Guild's operation is the quest board, though the reality is more sophisticated than a simple slab of cork. Each Guild tower maintains a comprehensive catalog of available work, organized by type, difficulty, location, and reward. When someone brings a problem to the Guild—a village plagued by dire wolves, a merchant needing escort through dangerous territory, a noble seeking rare ingredients for a potion—they meet with a Quest Registrar who documents every detail. The Registrar questions the client thoroughly, assessing the true nature of the problem, the likely dangers, and the client's ability to pay. This information enters the Guild's ledgers, and the quest receives a preliminary difficulty rating.\n\nThe rating system is the Guild's most valued innovation. Quests are classified from Bronze to Platinum, with subcategories within each level. A Bronze quest might involve clearing rats from a basement or delivering a package across town—work suitable for raw beginners. Silver quests require proven competence: escorting caravans through bandit country, hunting specific monsters, investigating disappearances. Gold quests demand real skill and experience: delving into ancient ruins, protecting dignitaries from assassination, breaking up organized criminal operations. Platinum quests are the stuff of legend: facing dragons, stopping magical catastrophes, venturing into places where the laws of reality bend. The system is not perfect, but it is remarkably reliable—the Guild's archivists study every completed quest, updating ratings based on what actually happened, so that future adventurers have the best possible information before accepting a job.\n\nWhen an adventurer accepts a quest, they sign a contract with the client, witnessed and sealed by the Guild. The contract specifies the task, the reward, and any special conditions. The Guild holds the reward in escrow until the quest is complete, protecting adventurers from clients who might otherwise refuse payment. Upon completion, a Guild representative verifies the work—sometimes in person, sometimes through magical communication, sometimes through trusted witnesses—and releases the funds, minus the Guild's fee. Disputes are arbitrated by Guild officials whose decisions, while not always popular, are accepted because everyone knows the alternative is chaos.\n\n**Adventurer Ranks and Identification**\n\nEvery registered adventurer receives a rank, determined by the number and difficulty of quests successfully completed. The ranks progress through the same metal scale as quests: Bronze, Silver, Gold, Platinum, with sub-levels within each. Advancement requires not just quantity but quality—a Silver-ranked adventurer must have completed Gold-level work under supervision, proven their judgment in crisis, and demonstrated the reliability that marks a true professional.\n\nThe rank functions as identification throughout Aethelgard, recognized by every major faction. A Bronze token proves you are not entirely useless; a Silver token opens doors that would otherwise remain closed; a Gold token commands respect even from those who have never heard your name; a Platinum token means you are one of the living legends, someone whose exploits are studied in academies and sung in taverns. City guards wave Platinum adventurers through checkpoints without inspection. Merchants extend them credit. Nobles invite them to dinner, hoping to hire them or simply to bask in reflected glory. The rank is not just a measure of combat ability—many Gold-ranked adventurers have never killed anything larger than a rat, specializing instead in tracking, negotiation, or lore—but a measure of trustworthiness, of having been tested and not found wanting.\n\n**The Many Faces of Adventuring**\n\nAdventurer is not a single profession but a thousand professions sharing a common framework. Some adventurers specialize in monster hunting, tracking beasts that threaten settlements and collecting bounties on their heads. Others focus on escort and protection, guiding travelers through dangerous regions or guarding merchants against bandits. Tomb delvers explore ancient ruins, seeking treasure and knowledge while avoiding the traps and guardians left by previous occupants. Investigators solve crimes and mysteries, their Guild credentials granting them access that ordinary citizens could never claim. Courier specialists carry messages and packages through territories too dangerous for ordinary messengers. Mediators resolve disputes between factions that cannot speak directly, their neutrality enforced by Guild sanction. Healers travel to communities that lack their own, trading medical services for food and lodging while seeking clients who need more permanent solutions.\n\nThe diversity extends beyond job types. Some adventurers work solo, valuing independence above safety. Others form parties—groups of complementary specialists who share risks and rewards, developing trust that can last lifetimes. Some treat adventuring as a temporary career, a way to earn enough for a farm or a shop or a comfortable retirement. Others cannot imagine any other life, chasing ever-greater challenges until they die in the attempt or achieve Platinum and simply keep going because stopping would mean dying anyway.\n\n**Support for Newcomers**\n\nThe Guild understands that every Platinum adventurer began as Bronze, and that many promising careers end before they start because beginners cannot afford basic equipment or do not know where to find reliable information. For this reason, the Guild offers substantial support to newly registered members.\n\nNew adventurers receive a basic orientation from Guild staff—maps of the local area, lists of reputable suppliers, warnings about common scams and dangers. Those who cannot afford equipment can request a starter loan, advanced against future quest earnings, sufficient to purchase basic gear and survive long enough to complete their first few jobs. The loan must be repaid with interest, but the terms are reasonable, and the Guild has been known to forgive debts for those who die in Guild-sanctioned work, sending the family what remains after funeral expenses.\n\nThe Guild also maintains libraries in every major tower, containing information accumulated over centuries—monster anatomies, regional maps, accounts of previous expeditions, lists of client types to trust and avoid. This information is free to members, though copying costs materials and time. Experienced adventurers often donate their own knowledge, adding to the collective wisdom and earning small credits toward Guild fees.\n\nFor those who need more than information, the Guild can arrange introductions to experienced adventurers willing to mentor newcomers—taking them on lower-risk portions of quests, teaching them the ropes, vouching for them when they seek Silver rank. These relationships are informal, not required, but they produce the best-prepared adventurers and the strongest loyalty to the Guild.\n\n**The Cost of Membership**\n\nThe Guild takes its cut: twenty percent of every quest reward, standard across all branches and all regions. This sounds steep, and it is—but the Guild earns every copper. The percentage covers the quest verification system that prevents fraud, the dispute resolution that protects both parties, the identification system that opens doors, the libraries and loans and support services that make adventuring viable. It funds the Guild towers and their staff, the archivists who update quest ratings, the healers who patch up returning adventurers, the messengers who carry news between branches. It builds the reserve fund that pays death benefits to families, that covers legal fees when adventurers are wrongly accused, that occasionally bails out members who made terrible decisions but deserve a second chance.\n\nSome adventurers grumble about the fee, especially when they complete dangerous work and watch a fifth of their reward vanish into Guild coffers. But those same adventurers, when cheated by a client, when falsely accused of a crime, when trapped in a foreign city with no resources, find the Guild's protection worth far more than the percentage ever cost them. And those who try to work outside the system, advertising their services independently, quickly discover why the system exists—clients who refuse to pay, disputes that escalate to violence, reputations destroyed by a single false accusation, deaths that no one investigates and families that never learn what happened.\n\n**Branches and Influence**\n\nThe Guild's main headquarters in Argent oversees a network of towers across Old Aethelgard. Each tower operates semi-autonomously, adapting to local conditions while maintaining core standards. The Luminas tower, for example, deals extensively with Imperium bureaucracy—adventurers there often need permits and clearances that Argent members never think about. The Khaz-Vorn tower integrates with dwarven clan structures, its quests filtered through the Hegemony's complex systems of debt and obligation. The Emberhold tower operates more informally, reflecting Federation values, with quests often posted verbally and ranked by consensus rather than formal assessment.\n\nRelations with major factions are carefully managed. The Guild is neutral by charter, accepting quests from any source regardless of politics, enforcing contracts regardless of which side hired which adventurer. This neutrality has been tested many times, especially during the Cold War's proxy conflicts, and the Guild has maintained it through strict discipline—adventurers who use Guild resources to pursue personal political agendas are expelled, their ranks revoked, their names posted in every tower as warnings. The system works because everyone benefits from it; even nations that distrust each other trust the Guild to handle quests honestly, and the alternative—no reliable way to hire competent help—is unacceptable.\n\n**The Adventurer's Life**\n\nFor those who choose it, the adventurer's life offers possibilities that no other profession can match. Freedom from routine, from masters, from the slow accumulation of days in the same place. The chance to see places that exist on no map, to meet people whose stories will never be written, to face challenges that would break ordinary souls and survive. The knowledge that somewhere, in a tavern or a palace or a simple farmhouse, someone is telling your story—embellished, exaggerated, transformed into legend—and that you earned every word of it.\n\nIt also offers early death, permanent injury, the slow erosion of friendships as colleagues fall one by one. It offers clients who lie and monsters that adapt and journeys that end in frozen passes with no rescue coming. It offers the certainty that someday, on some quest, you will face something you cannot defeat, and the only question is whether you will be remembered or simply become another name on another list of those who did not return.\n\nThe Guild does not pretend otherwise. Its recruiters describe the risks as honestly as the rewards. Its quest ratings warn of dangers without softening them. Its healers patch up survivors and its archivists record the dead, and the work continues because it must, because the world needs people willing to do what others cannot, and because somewhere in every city, someone is walking toward the quest board with hope in their heart and nothing in their pocket but a dream.\n\nThe Adventurer's Guild exists to make that dream possible—to give hope a framework, to give courage a direction, to give the dead at least the dignity of being remembered. It takes its percentage and it does its job, and across Aethelgard, in a hundred cities and a thousand towns, the quest boards fill and empty and fill again, and the adventurers come and go, and the world turns, and the work never ends."
}