{
  "type": "Main information",
  "title": "The Factions of Aethelgard",
  "content": "The Factions of Aethelgard: Powers Known and Hidden\n\nThe world of Aethelgard is not merely a collection of races and territories but a web of competing ambitions, ancient loyalties, and secret purposes. Every kingdom, every guild, every cult exists as a thread in this tapestry, pulling against others, weaving patterns that only the oldest elves and the most perceptive spies can begin to trace. What follows are the major factions that shape the world's destiny—the powers that march armies, the hands that move in shadows, and the voices that whisper in the spaces between.\n\n**The Solar Imperium** rises from the western plains of Old Aethelgard, a realm of white marble and polished brass where ambition is the highest virtue. Governed by the Synod of Light—a council of the most powerful Sun Sages, elected military commanders, and hereditary provincial lords—the Imperium believes in progress through discipline, in destiny through expansion. Its capital, Luminas, glows at night with captured daylight, its streets patrolled by legionaries in sun-tempered plate, its forums echoing with debates that blend philosophy, strategy, and trade policy. Within the Imperium, factions vie for influence: the Expansionist Bloc demands new territories along the Cinderwaste border; the Purification Circle seeks to limit non-human immigration to preserve human dominance; the Innovation Coterie funds dangerous experiments in arcane mechanics, believing knowledge justifies any risk. The Sun Sages themselves, the empire's magical elite, maintain their own internal hierarchies, from the Novices of the Dawn to the enigmatic Eclipse Council, whose members are said to have foreseen the empire's fall and work tirelessly to prevent it.\n\n**The Sylvanweald Enclave** claims the ancient forests of the east, though claim is too aggressive a word for what the elves consider simple stewardship. Their government is not a state but a consensus, reached through centuries of discussion among the great houses—Silverwood, Dawnshadow, Deeproot, and others whose names change with the seasons. The High Arcanists, masters of the Weave's most intricate geometries, hold no formal power yet shape policy through the weight of their wisdom. Within this apparent unity, tensions simmer: the Isolationists argue for sealing the Enclave entirely, letting the younger races destroy themselves beyond the forest's edge; the Interventionists, few but persistent, believe the elves must guide the world toward stability before another Cataclysm consumes everything; the Preservationists focus inward, cataloguing and protecting every species, every spell, every memory against the coming dark. Beneath all, the mysterious Circle of Roots meets in groves so ancient that their trees remember the first elves, and some say the Circle communicates with the forest itself, receiving instructions no elf would dare disobey.\n\n**The Dwarven Hegemony** is not a single nation but a federation of holds carved into the Ironvein Mountains, bound by ancient pacts and the shared memory of grudges. Each hold—Khaz-Vorn, the Forge-Heart; Dur-Harath, the Shield-Roof; Bor-Nagund, the Deep-Vault—operates with near-total autonomy, its clan council governing according to traditions older than human civilization. The High Thane, elected only during crises, rules from Khaz-Vorn but commands loyalty only as long as crisis lasts. Within the holds, guilds wield power that sometimes overshadows clans: the Rune-Scribes, who alone may carve new sigils; the Deep-Miners, who know secrets of veins and voids; the Forge-Brothers, whose craft determines a hold's wealth and military strength. The Grudge-Keepers maintain the vast ledgers where every slight and favour is recorded, some entries awaiting settlement for millennia. Recently, the Forge-Dynamists have emerged as a controversial faction, arguing that the Hegemony must share certain runic secrets with other nations to prevent them from developing catastrophic alternatives—a position many dwarves consider dangerously close to treason.\n\n**The Kith of the Rolling Hearth** are not a state but a people, their governance as mobile as their land-ships. Each caravan operates by consensus, its elders—those who remember most stories and have travelled farthest—guiding rather than commanding. Twice yearly, during the equinoxes, caravans converge at sacred meeting grounds to trade news, arrange marriages, and reaffirm the ancient Oath-Routes that define their territories. Within this loose structure, specialized roles carry influence: the Luck-Singers, whose hearth-magic weaves fortune for entire caravans; the Path-Finders, who read the shifting Expanse's moods; the Oath-Keepers, whose memories hold every promise made between Kith for generations. The Gossip-Caravans, smallest and fastest, travel alone, carrying messages between great powers and selling information that shapes continental politics—yet they remain fiercely neutral, for the Kith learned long ago that those who take sides eventually take losses.\n\n**The Federation of Cinders** governs the ash wastes of the Cinderwaste through meritocracy so pure that even outsiders grudgingly respect it. Any citizen may challenge any leader to single combat, to a contest of craft, or to a debate judged by randomly selected peers; the winner takes the position, and the loser returns to their previous role without shame. The Federation Council meets in the capital, Emberhold, a city built from the fused ruins of three pre-Cataclysm civilizations, its architecture a patchwork of salvaged beauty. Within this system, factions form around philosophy rather than lineage: the Ash-Walkers advocate for expansion into the fertile lands the Imperium guards; the Forge-Chanters prioritize magical and technological development, believing only superior weapons guarantee survival; the Blood-Pact Traditionalists argue for strengthening the ancient rites that first bound the Federation's disparate races together. The mysterious Cinder-Singers, few in number, claim to communicate with the volcanic vents themselves, warning of eruptions and, some whisper, awakening older fires beneath the waste.\n\n**The Glimmerdark Warrens** are the domain of the Dusk Elves, a matriarchal theocracy devoted to the dreaming goddess of secrets, whose name is spoken only in the deepest caverns. The High Priestesses of the Veil rule from the city of Nath-Zarak, their authority absolute yet rarely exercised, for they believe the goddess dreams their decisions and they need only listen. Below them, the Covens of Whisper wield practical power—the Weavers of Shadow, who craft darkness into cloaks and weapons; the Mind-Touch Sisters, who communicate across continents through psychic links; the Alchemists of the Deep, whose potions can preserve life for centuries or end it without trace. The Invisible College, a semi-heretical faction, seeks to understand surface magic and technology, believing the Glimmerdark must eventually emerge or be overrun; the Purists would seal every tunnel to the surface and let the sun-lit world burn itself to ash.\n\n**The Free-City of Argent** stands alone, an island metropolis governed not by blood or tradition but by gold and contract. The Guild Council—representing the Merchants, the Bankers, the Shipwrights, the Mercenaries, and a dozen lesser guilds—passes laws by majority vote, with each guild's votes weighted by its tax contribution. This mercantile oligarchy produces surprisingly stable governance, for no guild can dominate without bankrupting others, and all share interest in keeping Argent neutral and prosperous. Within this chaos of commerce, factions operate openly: the Exchange, the city's largest bank, whose vaults are said to hold debts from every nation; the Dockside Authority, which controls the port and knows every ship's cargo and captain; the College of Unbound Beings, scholars who study elementals, spirits, and dragons with equal detachment; the Spire, a tower of mages who offer their services to any paying client, regardless of nation or cause. Beneath all, the Shadow Market trades in what cannot be sold openly—stolen spells, forbidden texts, the memories of executed criminals, and services no guild would sanction.\n\n**The Sunsowers** are a cult of renewal that has spread like root-fungi through every nation, though they claim no capital and seek no power. They believe the Cataclysm was not disaster but pruning, that the world grows strongest when burned and regrown, and that another cleansing approaches. Their members—farmers, scholars, minor nobles, desperate refugees—prepare not to survive the coming fire but to plant the seeds that will grow from its ashes. They are not terrorists; they do not hasten the end, for they trust it will come in its own time. They simply prepare, stockpiling knowledge and viable seed-grain and the eggs of endangered creatures, waiting for the day when they emerge from shelters to replant a world made ready for better growth. Governments tolerate them as harmless eccentrics, unaware that Sunsowers hold positions in every bureaucracy, every magical college, every army's logistics corps—waiting.\n\n**The Ashen Creed** is something darker, a death-cult born from the Cinderwaste's harshest settlements. They worship not the Pulse but its absence, the stillness that comes when magic dies, the silence after the last heartbeat. Their members—often those who have lost everything to magical catastrophe—seek to accelerate the world's end, believing that only in complete annihilation can true peace be found. They poison wells with anti-magical compounds, sabotage wards that protect cities from elemental incursions, and whisper prophecies of the Great Unraveling when the Pulse will finally cease and all things will be equal in nothingness. Most nations consider them a minor nuisance, barely distinguishable from bandits; the Dusk Elves, who understand entropy's seduction, hunt them with quiet, relentless efficiency.\n\n**The Guild of the Open Hand** operates in every major city, a network of thieves, information-brokers, and fixers who have elevated larceny to something approaching public service. They do not steal from the poor, they enforce a crude code of honour among criminals, and they sell information to anyone but charge more to those who would use it for mass harm. Their structure is deliberately obscure—members know only their immediate contacts, and the Guildmaster's identity is a rumour that changes with each telling. The Open Hand has prevented at least three wars by leaking compromising information simultaneously to both sides, forcing embarrassed negotiations instead of battles. They are not good, by any standard measure; they are simply self-interested enough to recognize that total chaos is bad for business.\n\n**The Order of the Silent Vigil** claims direct descent from the Wardens who enforced the Starfall Accord's prohibition on World-Rending magic. They maintain chapter houses in every nation, always small, always austere, always watching. Their members are spellbreakers, trained to detect and dismantle catastrophic magic before it can be unleashed. They have no authority to arrest, no army to enforce their findings—they simply observe, document, and when necessary, act through methods that leave no evidence. Nations tolerate them because the alternative is mutual destruction; secretly, every government funds research into countering Silent Vigil detection methods, and every government knows their rivals do the same. The Order's current leadership, based in a fortress on the Isle of Echoes, is increasingly divided between those who believe the Accord can be preserved and those who prepare for its inevitable collapse.\n\n**The Chromatic Compact** is not an organization but a rumour that will not die—whispers that certain chromatic dragons have set aside their ancient solitude to form a loose alliance, motivated by the growing power of mortal magic and the shrinking of wild territories. No proof exists, yet traders in the Cinderwaste sometimes report seeing multiple dragons flying together, and dwarven scouts have found lairs in the Ironvein peaks that show signs of shared habitation. If true, the Compact would be the first dragon alliance in recorded history, and its purpose—defensive, predatory, or something stranger—is the subject of frantic speculation among every nation's intelligence services. The metallic dragons, when asked, respond with silence so absolute it feels like disapproval.\n\n**The Unwoven** are the broken ones, mages who touched something they should not have and survived—changed. They are not a faction in the sense of having leaders or goals; they are a category, individuals scattered across the world, each uniquely warped by magical trauma. Some see the true nature of the Pulse and cannot bear the sight; others speak to the dead or hear the thoughts of elementals or bleed raw magic from old wounds. They seek each other out occasionally, forming temporary sanctuaries where they can rest from a world that finds them terrifying or insane. The nations fear them, for their condition is contagious in ways no healer understands, and the Order of the Silent Vigil quietly tracks their movements, uncertain whether they are omens, weapons, or simply victims who deserve peace.\n\n**The Pale Conclave** gathers the necromancers, the soul-binders, the scholars of death who have been driven from polite society into the margins where the dead outnumber the living. They meet in secret, in places where the veil between worlds wears thin—battlefields, plague towns, the sites of mass executions. Their purposes vary wildly: some seek to reverse death itself, others to weaponize it, others merely to understand what waits beyond. The Conclave has no central authority, no shared creed, only the mutual recognition that they are outcasts who can learn from each other. The nations hunt them when convenient and employ them when desperate, for a necromancer's talents are invaluable in war and useless in peace. The Conclave endures, as the dead endure, patient and unmourned.\n\nThese are the factions that shape Aethelgard, but they are not the whole. Beneath them, within them, between them, smaller groups form and dissolve—the Hearth-Guardians who protect villages from monsters, the Lore-Stealers who raid ruins for forgotten texts, the Dawn-Chasers who follow rumors of new magic across continents. Every alignment, every ambition, every madness finds its fellowship somewhere in this world. And above them all, the great powers watch each other, and prepare, and wait for the crack in the glass that will shatter everything or nothing at all."
}