{
  "type": "Main information",
  "title": "The Geography of Aethelgard",
  "content": "The World of Aethelgard: A Geography of Powers\n\nAethelgard is a world of vast oceans, ancient continents, and seas that have borne the weight of empires. Its lands are carved by the Pulse itself, shaped by cataclysm and the slow patience of elemental forces. To understand the great powers and their conflicts is first to know where they stand—and where they cannot reach.\n\nThe continent of Old Aethelgard dominates the northern hemisphere, a sprawling landmass of temperate forests, rolling plains, and mountain spines that rise like the world's own bones. To the west, the Solar Imperium spreads across fertile coastal plains, its white-marbled cities facing the Sunset Sea, where trade routes reach toward distant, unmapped shores. Eastward, the Sylvanweald Enclave claims the ancient forests that have stood since before the first mortal spoke, their boundaries guarded by floating quartz citadels and trees whose roots delve into the world's oldest dreams. Between these two powers, the Ironvein Mountains rise like a fortress wall, their peaks eternally snow-capped, their depths honeycombed by the Dwarven Hegemony's holds. South of the mountains, the Cinderwaste sprawls across what was once fertile kingdom—a scarred wasteland of ash plains, volcanic vents, and hardy scrub, where the Federation of Cinders carved survival from cataclysm's wreckage. Beyond the Cinderwaste, the Shifting Expanse stretches to the southern coast, a sea of grass that moves with unseen currents, crossed by the land-ships of the Halfling Kith following spirit-paths only they can read.\n\nTo the west from old Aethelgard, across the Serpent's Jaw Strait from Old Aethelgard lies the sun-scorched continent of Kharakun, where crimson deserts meet jungle-choked river valleys and mountain ranges that breathe smoke. Here, ancient kingdoms of serpent-folk and forgotten dynasties crumbled before the Cataclysm, leaving behind ruins that still pulse with dormant magic. The Free-City of Argent, though nominally part of Old Aethelgard's island chain, maintains trading enclaves along Kharakun's northern coast, bargaining with nomadic tribes who worship gods whose names change with the seasons. Few expeditions penetrate the interior and return unchanged; those who do speak of cities built from the bones of leviathans, of jungles where the Pulse runs so thick that trees move when unobserved, of deserts that sing to travellers in voices that might be wind or might be something older.\n\nBetween these continents, the Inner Sea spreads like a liquid heart, its waters the colour of old wine at sunset and treacherous as any politics. This sea is the world's great highway, carrying the commerce that binds nations and the spies that undo them. Its islands host micro-nations, pirate havens, and the isolated fortresses of orders who have withdrawn from continental squabbles. The largest of these, the Isle of Echoes, rises from the sea's centre like a clenched fist—a place where the Pulse reverberates strangely, amplifying magic and memory until past and present blur. No nation claims it, though all have tried; the isle's current inhabitants, a reclusive order of monks who speak only in the subjunctive tense, tolerate no flags but their own.\n\nNorth of Old Aethelgard, beyond the Frostfang Strait, lies the frozen continent of Vintergard, its coasts gnawed by ice that never fully melts. Here, in the endless twilight of northern winters, the Dusk Elves of the Glimmerdark maintain their sunless realm beneath the permafrost, their cavern cities connected to the surface through hidden vents that exhale warm, fungus-scented air. Above ground, the ice-fields are haunted by solitary white dragons, by tribes of frost-kin who worship the aurora, and by the ruins of a civilization that predates the current races—vast structures of black stone that absorb light and radiate a cold deeper than winter. The Solar Imperium maintains a single, heavily fortified outpost on Vintergard's southern coast, ostensibly for scientific study, actually for watching the Dusk Elves' northern approaches.\n\nFar to the east, across the trackless Verdant Ocean, legends speak of the Jade Continent, where the Pulse manifests as living crystal and the forests grow upside-down into mist-shrouded canyons. No nation of Old Aethelgard has established permanent contact with this fabled land, though Halfling spirit-paths sometimes extend across the ocean during certain celestial alignments, and those who return speak of cities where the architecture breathes and the inhabitants wear masks that show their true faces. The dragons know of it—some were born there, before the Cataclysm drove them west—but they do not speak of it, and those who press for answers find the conversation ending in fire or flight.\n\nBeneath all continents, threading through the world like veins through a body, run the Deepways—cavern systems so vast that they constitute a world unto themselves. The Glimmerdark is merely the most accessible and habitable layer, the realm where Dusk Elves and Night-Cousins have carved their civilizations. Deeper still lie the Sunless Seas, underground oceans lit by bioluminescent plankton, where blind leviathans hunt and cities of exiled deep-ones dream of the surface they have never seen. Deepest of all, where the pressure would crush any mortal vessel and the Pulse beats like a second heart, lie the chambers of the Sleeping Gods—entities so vast and ancient that the continents above are merely the sediment of their slumber. No road leads there, no map charts those depths, and those who claim to have returned are either liars or something that wears the shape of those who descended.\n\nThe world, then, is not merely a collection of nations but a palimpsest of powers stacked vertically as well as horizontally. What happens in the Glimmerdark affects the Ironvein holds above it; what stirs in Vintergard's deep ice sends tremors through the Dusk Elf caverns; what dreams in the chambers beneath the Inner Sea sends ripples through the dreams of every sensitive in Argent. The nations measure their borders in leagues and their armies in thousands, but beneath their feet and beyond their horizons, older boundaries hold, measured in epochs and patrolled by things that do not count in mortal numbers. This is Aethelgard: a world where the map is always incomplete, where every border is contested, and where the greatest powers are often those that appear on no chart at all."
}