{
  "type": "Detailed information",
  "title": "The Beginning adventurer products in free city of Argent.json",
  "content": "The Beginner's Guide to Argent: What Things Cost and Where to Find Them\n\nThe Free-City of Argent rises from its island like a merchant's dream made stone—warehouses crammed with spices from Kharakun, silk from elven looms, adamantine ingots from dwarven holds, and a thousand other goods flowing through its harbor like blood through a heart. For the newly arrived, for the aspiring adventurer with coin in pocket and ambition in heart, the city offers everything needed to begin a career of danger and profit. The challenge is not finding what you need but navigating the chaos of options, avoiding the scams that await the unwary, and spending your limited silver where it will serve you best.\n\n**Lodging** ranges from the squalid to the sublime, with prices to match. The cheapest accommodations cluster near the Docks—the Salty Mermaid, the Drowned Rat, establishments whose names warn as clearly as their prices promise misery. A night in such places costs one copper standard, sometimes less if you share a room with strangers, sometimes nothing if you agree to wake the innkeeper at odd hours or run errands during the day. You will sleep on straw, eat whatever sludge passes for stew, and guard your belongings with hand on hilt. One step up, in the warrens of the Artifice Quarter or the edges of the Merchant's District, establishments like the Gilded Tankard or the Copper Kettle offer private rooms for five copper a night, including a proper bed, a washbasin, and breakfast of bread and ale. For those with silver to spend, the major guilds maintain guest houses—the Merchants' Rest in the heart of the district charges one silver for a room that would satisfy a minor noble, with real sheets, hot water brought on request, and meals that feature meat and fresh vegetables.\n\n**Food and Drink** sustain body and spirit at every price point. Street vendors throughout the city sell meat pies for two copper, grilled fish skewers for three, and the famous Argent street-bread—flat loaves stuffed with spiced vegetables—for a single copper, enough to fill a hungry belly. Taverns offer meals at varying quality: a plate of bread, cheese, and pickled vegetables runs five copper at a place like the Dockside Galley; a proper dinner of roasted meat, fresh bread, and ale costs one silver at establishments catering to merchants and successful adventurers. Drink prices follow similar patterns: ale at one copper per pint in working-class taverns, three copper in nicer establishments, wine starting at five copper for something drinkable and climbing to gold pieces for vintages brought from the Sylvanweald's ancient vineyards. The wise newcomer learns which taverns water their ale (most do) and which serve it honest (those are worth remembering).\n\n**Basic Gear** for the aspiring adventurer can be found throughout the city, but the Artifice Quarter offers the widest selection and sharpest competition. A backpack of treated canvas costs two silver at any reputable leatherworker; a bedroll adds another silver; a waterskin, five copper. Rations for a week—dried meat, hard cheese, journey-bread—run one silver from provisioners near any gate. Rope, fifty feet of good hempen, costs three silver from ships' chandlers in the Docks, where quality matters more than anywhere else. A grappling hook adds another two silver. Flint and steel, essential for any traveler, cost five copper and last indefinitely if not lost. Lanterns (one silver) and oil flasks (five copper each) light the darkness, while candles (one copper for a dozen) serve for less demanding situations. The wise adventurer also purchases a small notebook of treated paper (three silver) and charcoal sticks (one copper each) for recording observations, copying maps, and leaving messages.\n\n**Weapons and Armor** represent the largest investment for those who expect danger. Simple weapons are cheap and plentiful: a dagger costs one silver at any cutler's shop; a short sword, five silver; a handaxe, three silver; a sling with twenty bullets, one silver. Quality improves with price—a sword from a reputable smith in the Artifice Quarter costs double but holds its edge longer and bends less often in combat. Bows start at five silver for a basic shortbow, with arrows at one copper each or one silver for two dozen if bought in bulk. Armor costs escalate quickly: a padded gambeson runs five silver; leather armor, carefully treated and fitted, costs one gold; a mail shirt, the dream of any infantryman, starts at fifteen gold and requires maintenance that adds to its cost. Shields of reinforced wood cost three silver; those banded with iron, eight silver. The Armorer's Guild maintains inspection stations throughout the city—for a fee of one copper, a guildsman will certify that your purchase is not dangerously flawed, a service many newcomers skip and many regret.\n\n**Arcane Supplies** for those with magical talent or ambition require navigating specialized markets. The Enclave Exchange, a district within the Artifice Quarter run by transplanted Halfling traders, offers the widest selection of spell components. Basic material components—bat guano for fire spells, feathers for flight magic, bits of fleece for illusions—cost copper rather than silver, sold by the pouch from bins that line the walls. Scrolls of common spells, penned by apprentices needing practice, sell for five to twenty silver depending on complexity and legibility. Potions represent the most accessible magic for the non-magical: a potion of healing, brewed by the Sisters of the Green Mother's local chapter, costs five gold from authorized vendors—double that from street-corner alchemists whose products may or may not work. Potions of night vision run eight gold, waterproofing potions (essential for sea travel) three gold, and the rare potions of invisibility, when available, start at fifty gold and climb rapidly.\n\n**The Spire's Influence** touches all magical commerce, for the mages of Argent's great tower regulate what can be sold openly. Registered spellcasters pay annual fees of five gold to the Spire's Licensing Office, receiving marks of authority that allow them to purchase restricted components—anything involving demonic contact, necromancy, or reality-warping requires such licensing, and unlicensed possession draws attention no newcomer wants. The Spire also maintains a public repository of basic spell formulae for one gold per spell, a service that has launched a thousand magical careers. Those seeking instruction can find licensed tutors for ten gold per month of study, though results vary wildly with the tutor's skill and the student's dedication.\n\n**Information** is Argent's most traded commodity, and its prices reflect its value. The Gossip-Caravans maintain a public house near the Merchants' District where basic rumors cost one silver and verified information costs whatever the market will bear. The city criers, employed by the Guild Council, announce official news at dawn and dusk for free—anyone may listen, and anyone may ask questions, though answers come only at the crier's discretion. Tavern gossip costs only the price of a drink, but its reliability matches its price. For those seeking work, the Adventurer's Guild maintains a job board near the Docks where contracts are posted and negotiated; registration costs one silver and lasts a lifetime, and the guild takes ten percent of any contract's value as its fee, collected upon completion.\n\n**Transportation** within the city costs little—Argent is walkable for the fit, and those who cannot walk rely on sedan chairs (one copper per quarter-mile) or the occasional hired wagon (five copper for a load within the walls). Leaving the city requires more serious investment. Passage on coastal vessels to Imperium ports runs one silver per hundred miles, plus food. Ships to distant destinations—the Cinderwaste's harsh shores, the Dwarven holds' mountain ports, the Sylvanweald's guarded river entries—cost more, starting at five gold for the shortest voyages, and require negotiation with captains who may demand additional fees for passengers who look like trouble. The Halfling land-ships that occasionally visit Argent's outskirts charge similarly for passage across the Shifting Expanse, though they prefer passengers who can work during the journey and may reduce fares accordingly.\n\n**Services** essential to adventuring life abound. Healers certified by the Temple of the Green Mother charge one silver for examination and treatment of minor wounds, scaling to gold for serious injuries or magical healing. The Chirurgeon's Guild, less expensive but more painful, charges five copper for basic care—they will stitch wounds, set bones, and amputate what cannot be saved, all with the patient awake and screaming. Stabling for mounts costs three copper per night at livery stables near any gate, including feed and basic grooming. Gear repair—patching leather, mending chain, sharpening blades—costs ten percent of the item's value on average, with rush jobs doubling the price. Messengers willing to carry letters anywhere in the city charge one copper per mile, negotiable for dangerous deliveries or urgent deadlines.\n\n**The Shadow Market** exists for those who need what cannot be bought openly. Its location shifts weekly, its vendors trust no one, and its prices reflect its risks. Poison, rare and strictly regulated, sells for ten gold per dose if you can find a seller willing to risk the Spire's wrath. Stolen goods move at half their legitimate value, assuming you can verify they are not too hot to sell. Forbidden texts—demonology, necromancy, the old treaties that named the World-Rending spells—appear occasionally, priced at whatever the seller imagines the buyer will pay. The wise approach the Shadow Market only with local guidance, only with empty pockets until they know what they seek, and only with an escape route planned in advance. The foolish approach it once, and become lessons for the wise.\n\n**Currency Itself** requires understanding, for Argent's economy runs on multiple standards. The copper standard is the everyday coin, slightly larger than a thumbnail, stamped with the Guild Council's scales. One hundred copper make a silver standard, stamped with Argent's tower. One hundred silver make a gold standard, stamped with the city's ship-and-wave crest. Gold standards from other nations circulate at varying exchange rates—Imperium suns are worth ninety-five copper due to their lower purity, Dwarven throne-marks worth one hundred ten due to their higher gold content and the Hegemony's insistence on quality. Moneychangers near every market charge one percent to convert between currencies, two percent if you look desperate or foreign. Banks, most notably the Exchange, offer safekeeping for a fee of one copper per ten gold per month, and their vaults are said to be impregnable—a claim tested many times and never yet proven false.\n\n**The Beginner's Budget** assumes certain priorities. A newly arrived adventurer with ten gold can outfit themselves decently: lodging for a month at five copper per night (one and a half gold), basic gear and weapons (three to four gold), rations and incidentals (one gold), leaving three to four gold for emergencies and the inevitable bribes that Argent's officials expect for various permissions. Those with less must scrape, must accept riskier lodgings and cheaper gear, must take jobs that more established adventurers refuse. Those with more can afford quality, can skip the cheap inns and unreliable weapons, can pay for training and information that accelerates their careers. But all begin somewhere, and Argent has seen a thousand thousand beginnings—some ending in wealth and fame, some in unmarked graves, most somewhere in between, in the long slog of work and survival that defines the adventurer's life until luck or skill lifts them above the crowd.\n\nThe city waits, indifferent to individual fates, ready to sell whatever each newcomer needs at whatever price each newcomer can pay. The wise learn quickly. The foolish learn expensively. And the dead learn nothing at all."
}