{
  "type": "Main information",
  "title": "The Technologies of Aethelgard",
  "content": "The Tools of Aethelgard: Magic and Mechanism\n\nThe technology of Aethelgard rests upon a foundation of late medieval craft—black iron forged in charcoal fires, timber framed with mortise and tenon, parchment inked by lamplight, roads paved with stone and maintained by legion labor. Swords take the shape of steel folded upon itself, plows cut furrows through soil that has known the blade for millennia, ships carry square sails and lateen rigs across seas charted by generations of patient navigation. This is the base layer, the shared inheritance of all races, the technology that works whether the Pulse sleeps or wakes, whether magic flows or falters. Yet upon this foundation, magic has built wonders that would astonish any visitor from a world where physics alone holds sway.\n\n**Arcane Infrastructure** transforms how cities function. In Luminas, streetlamps burn with captured daylight, brightening at dusk and dimming at dawn through spells woven into the crystal housings. Argent's harbor is lit by ever-burning beacons whose flames consume no fuel, their magic keyed to respond only to authorized ships' approach. The Dwarven holds channel geothermal heat through rune-traced vents, warming entire cavern-cities without smoke or soot. Aqueducts in the Imperium incorporate purification glyphs that render water drinkable after passing through carved stone channels, reducing waterborne disease to levels other nations envy. The Sylvanweald needs none of this—their grown quartz citadels regulate temperature naturally, their water flows pure from ancient springs—but they nevertheless employ magic to maintain the ancient wards that protect their borders from the creeping entropy of the outside world.\n\n**Communication** bridges distances that would otherwise isolate. Message crystals, pairs of quartz spheres enchanted to vibrate in sympathetic resonance, allow real-time conversation across hundreds of miles—though each pair is expensive, requiring a skilled arcanist months to bond, and the crystals shatter if overused. The Halfling Kith prefer their own methods: trained messenger birds with minor enchantments ensuring they never lose their way, and the Luck-Singers' ability to fold meaning into stories that travel faster than any messenger. The Dusk Elves of the Glimmerdark communicate through psychic resonance, their Mind-Touch Sisters relaying information across continents through networks that leave no physical trace. For urgent military communications, the Imperium employs signal towers with arcane reflectors that flash coded light across valleys, each station manned by Sun Sage initiates who can relay a message from the Cinderwaste border to Luminas in hours rather than weeks.\n\n**Transportation** remains largely bound to muscle and wind, but magic eases the journey. Dwarven trade roads incorporate runes of levitation at steep grades, allowing heavily laden wagons to ascend inclines that would otherwise require double teams of oxen. Halfling land-ships skim across the Shifting Expanse on cushions of woven air, their sails catching not wind but the subtle currents of the Pulse itself. The Sylvanweald maintains living bridges—trees grown over centuries into forms that arch across chasms, their branches woven into railings, their roots anchoring them against any storm. The Imperium experiments with teleportation circles, permanent arrays that could instantaneously move troops or trade goods, but the energy requirements are staggering and the failure modes catastrophic; only three exist, all in heavily fortified military installations, and their use requires authorization from the Eclipse Council itself.\n\n**Weaponry** balances the familiar and the fantastic. Standard armies fight with steel and bow, pike and crossbow, siege engines that throw stone through torsion and counterweight. Yet alongside these, magical artillery has transformed warfare. The Imperium deploys sun-lances, focusing daylight through enchanted lenses into beams that can set enemy siege towers ablaze at a thousand paces. Dwarven bolt-throwers launch quarrels inscribed with runes of seeking, curving through the air to strike commanders behind their shields. The Federation of Cinders employs elemental-bound catapults that hurl not stone but concentrated flame, their ammunition drawn from the volcanic vents that scar their homeland. Defensive magic keeps pace: ward-stones project shimmering domes that absorb spell-fire, enchanters weave protective auras into the armor of elite troops, and the Order of the Silent Vigil maintains its ancient art of spell-breaking, capable of unraveling enemy enchantments before they can take effect.\n\n**Healing and Medicine** straddle the line between art and science. Chirurgeons understand wound-cautery, amputation, and the rudiments of infection—they know that wounds washed in wine heal cleaner, that honey delays putrefaction, that certain herbs reduce fever. Clerical healing supplements this knowledge with direct divine intervention: priests of the Green Mother can knit flesh with a touch, followers of the Silent Father ease the passage of the dying, and even minor temples keep scrolls of healing for emergencies. Alchemists produce potions that mimic these effects for those who cannot afford a priest's attention, though their brews are less reliable and often carry side effects—nausea, temporary weakness, in rare cases the permanent dulling of the senses. The Dusk Elves excel at alchemical healing, their deep-earth fungi yielding compounds that can regenerate lost tissue, though the process is agonizing and leaves distinctive scarring that marks the recipient for life.\n\n**Industry and Craft** benefit enormously from magical assistance. Dwarven forges achieve temperatures impossible through fuel alone, their rune-enhanced bellows driving flames hot enough to work adamantine. Elven looms weave cloth that never stains and never wears, the threads enchanted before they ever touch the shuttle. Human tanneries employ purification glyphs that render their profession less foul and less polluting, though traditionalists complain that magic-tanned leather lacks the character of the old ways. Gnomish and goblin tinkerers, found primarily in Argent and the Federation's workshops, combine mechanical ingenuity with salvaged magical components to create devices that blur every boundary: self-winding clocks that never need adjustment, prosthetic limbs that respond to thought, cooking pots that stir themselves and never burn the bottom.\n\n**Recording and Memory** have evolved beyond parchment and ink. Dwarven memory-crystals store information in faceted matrices, each crystal holding the equivalent of a dozen books, readable by those with the gift to touch the crystal and see. Elven lore-trees grow their records, leaves inscribed with text that shifts as new information is added, branches that reach toward those who seek specific knowledge. The Imperium's Sun Sages have developed light-scribing, burning words onto prepared stone with focused beams that leave permanent, weather-resistant records. Most radically, the Dusk Elves practice memory-theft and memory-gift, the ability to transfer experiences directly from one mind to another—a practice universally outlawed outside the Glimmerdark, for its potential for abuse is as vast as its potential for education.\n\n**Limitations** bind all these technologies. Magic requires the Pulse, and the Pulse is not infinitely malleable; overuse in a region can deplete local magic, requiring days or weeks for recovery. Enchanted objects eventually fail, their magic bleeding away like water from a cracked vessel, and only skilled arcanists can renew them. The great powers hoard their technological advantages jealously, for to share a secret is to lose an edge. And beneath all runs the knowledge, inherited from the Cataclysm, that magic pushed too far can break the world. Every nation maintains its own version of the Starfall Accord's prohibitions, its own list of techniques too dangerous to pursue, its own black-ops programs that pursue them anyway, in deepest secrecy.\n\nThe result is a world where a farmer plows with oxen and a wooden plow, yet that same farmer's child may carry a message to the next valley by touching a crystal that glows with distant speech. Where armies march on foot and fight with steel, yet their commanders consult oracles and their scouts ride winds that no horse could climb. Where a wound that would kill in one century can be healed in the next, yet plagues still sweep through cities whose purification glyphs were neglected during budget cuts. Technology in Aethelgard is not a ladder of progress but a web of possibilities, some ancient, some new, all contingent on forces that cannot be fully controlled. The wise adapt. The arrogant break. And the world endures, as it always has, waiting for the next bright mind to discover something wonderful or terrible or both."
}