{
  "type": "Detailed information",
  "title": "The Avian Kin race",
  "content": "Avian Kin are the breath between heartbeats, the shadow that passes over the sun, the voice that carries across valleys without effort. Across Aethelgard they are known by many names—Skysight, Storm-Callers, Cloud-Walkers, the Winged—but all share the inheritance of hollow bone and feathered limb, the ancient longing for height and horizon. Their forms span the full spectrum of avian lineage: the broad-winged, eagle-kin of the high peaks, their feathers bronze and russet, their beaks curved for tearing; the slender, swallow-swift messengers of the coastal cliffs, plumage of silver-grey and sea-foam, their tails streaming like pennants; the compact, owl-silent hunters of the deep forests, feathers mottled in dusk-brown and moon-white, their great round eyes reading the dark as others read script; and the iridescent, song-bright heralds of the southern gardens, tiny and jewel-like, their voices capable of carrying complex messages across entire city districts. Their eyes hold the sharp, unwavering focus of the hunter scanning fields from impossible heights, and their hollow bones make them weightless in ways that unsettle ground-bound races who do not understand how anything so solid-looking can be so light. They live roughly a century and a half, though the great eagle-kin of the peaks are said to stretch this to two centuries, their feathers greying with an dignity that demands respect.\n\nTheir magic is written in wind and distance. Avian Kin do not command the Pulse through study or blood-pact; they simply ride it as naturally as they ride thermal currents. This is the gift of Skysight, the ability to see not merely with eyes but with the whole body's awareness of pressure, temperature, and the subtle shifts in air that precede storm or ambush. A Storm-Caller can feel a thunderhead building three counties away, can taste the lightning in it before the first cloud darkens the horizon. Their greatest elders, the Cloud-Walkers, can ascend to altitudes that would kill other creatures and simply... linger there, wrapped in mist, watching the movements of armies and herds with the patient disinterest of gods. This is not spellcraft but inheritance, the Pulse flowing through vestibular systems so refined that a Skysight scout can close their eyes and tell you, by the pressure on their pinions, exactly how many birds share their thermal and whether any are strangers.\n\nSociety among Avian Kin is structured around the Flock and the Eyrie, terms that encompass both kinship and territory. A Flock is the mobile unit—those who hunt together, migrate together, share the same winds and hunting grounds. Eyries are the ancestral roosts, cliff-faces and ancient trees and the high towers of certain cities where generations have nested, returning each season to repair and remember. Leadership within a Flock is fluid, determined by whoever reads the winds most accurately that day, and disputes are settled by aerial displays that leave ground-bound observers dizzy and impressed. They have no written language to speak of, at least not on parchment; their histories are carried in song, in the complex melodies that echo across valleys during migration, and in the patterns of feather-art they weave into their nesting materials. A young Avian Kin learns their genealogy not through names but through the specific trills and pauses that identify which Flock claimed which ridge for which century.\n\nIn the wider world, Avian Kin occupy a unique niche of tolerated necessity. The Solar Imperium employs them as long-distance couriers and border scouts, their speed and perspective making them invaluable for monitoring the restless frontier with the Cinderwaste. A Skysight messenger can cross in two days what takes a horse a week, and they carry news with the additional benefit of having seen the terrain below and can supplement written dispatches with spoken observations of smoke, herd movements, or marching columns. The Free-City of Argent maintains a permanent Skysight Guildhall in the highest tower of the Merchants' Quarter, where merchants pay premium rates for delivery guaranteed by wing rather than wheel. The Dwarven Hegemony, despite their deep suspicion of anything that cannot be weighed in ore, grudgingly employs Avian scouts to map surface trade routes and warn of approaching armies—though they insist on written contracts weighted with lead seals to prevent what they imagine might be frivolous air-borne renegotiation.\n\nAmong the other Beast Kin, Avian Kin maintain complex relationships of altitude and affinity. They share with Feline Kin a certain predatory reserve, though they find the cats' fixation on ground-level detail frankly parochial. Canine Kin they regard with affectionate bemusement—all that loyalty, all that earnest sniffing, and they never think to look up. The Reptilian Kin, cold-blooded and earth-bound, they respect as ancient cousins who chose a different element, and occasional trade happens between high eyries and sun-baked Nests, eggs for feathers, stories for stories. The Avian Kin themselves regard the ground-bound races with the same distant tolerance they might offer particularly interesting herd animals—useful, occasionally beautiful, but fundamentally unaware of the larger patterns visible only from height. They circle, they watch, they carry messages and warnings, and when the great powers finally tire of cold war and march their armies across the plains, the Avian Kin will see it first, will trace the dust of columns and the glint of spear-points, and will sing the news across the valleys. Whether anyone listens is not their concern. They have done what wings were made for."
}