{
  "type": "Detailed information",
  "title": "The Bat and Arachnid Kin race",
  "content": "Bat and Arachnid Kin are the silence between footfalls, the movement at the edge of torchlight, the weavers of shadow and whisper. Across Aethelgard they are known as Veil-Wings, Web-Weavers, Echo-Folk, or simply the Night-Cousins, though they rarely speak such names aloud where surface-dwellers might hear. Their forms divide along winged and many-legged lines, yet both carry the same gift for darkness and the same patience for secrets. Bat-kin stand small and fine-boned, their bodies covered in velvet-soft fur of charcoal, midnight blue, or silvered brown, with membranous wings that fold against their spines like cloaks when not in use. Their faces hold the delicate, almost vulpine sharpness of their totem, ears enormous and ever-twitching, noses wrinkled in permanent, necessary attention to the scents carried on cavern breezes. Arachnid-kin are spare and angular, their limbs jointed in ways that unsettle surface eyes, their skin bearing the chitinous sheen of deep blacks, purples, and the red-brown of rusted iron. Multiple eyes—four, six, eight—arrange in patterns that see movement where others see stillness, and their fingers, long and dexterous, move in the complex gestures of weavers and alchemists. Both lineages live roughly two centuries, though the deepest-dwelling among them claim elders who have not seen sunlight since the Cataclysm and measure time in fungal harvests rather than years.\n\nTheir magic is the language of vibration and shadow. Bat and Arachnid Kin do not command the Pulse through ritual or study; they instead perceive it as an extension of their natural senses, reading the world through echoes and tremors that other races cannot detect. A Veil-Wing scout can navigate absolute darkness by singing silently, their inner ear interpreting the returning pressure-waves as clearly as others see by daylight. A Web-Weaver can feel the approach of strangers through the threads of their territory, can read the emotional state of a visitor by the micro-vibrations transmitted through stone and silk. This is not spellcraft but inheritance, the Pulse flowing through neural pathways honed by millennia of dwelling where light does not reach. Their greatest elders practice what the Dusk Elves call Whisper-Weaving, the ability to project thoughts along vibration-threads, to communicate across miles of cavern without sound, to leave memories hanging in silk-strung chambers for others to absorb by touch alone.\n\nSociety among Bat and Arachnid Kin is built around the Covens and the Solitary, a paradox that resolves in the geometry of darkness. They gather in Covens for specific purposes—the harvest of bioluminescent fungi, the defense of crucial cavern systems, the sharing of surface-news brought by those who dare the twilight thresholds—but these gatherings are temporary, tactical, devoid of the warm kinship that binds canine or ursine peoples. Between gatherings, they return to Solitary, each claiming a web-chamber or echo-niche where they pursue their own work: alchemy, information-weaving, the patient observation of the world through threads and echoes. They have no kings, no councils, no written laws; what order exists emerges from the simple geometry of territory, the understanding that certain vibrations mean trespass and certain others mean invitation. Their young are raised not by pairs but by the Covens collectively, taught to read the deep earth's whispers before they learn to speak, then released to find their own Solitary spaces when they can navigate unguided.\n\nIn the wider world, Bat and Arachnid Kin have found their most profound integration within the Glimmerdark, where Dusk Elves recognize in them kindred spirits who move through shadow as easily as elves move through twilight. Veil-Wing Covens serve as sentinels along the great cavern approaches, their echolocation detecting intruders long before any torch illuminates the dark. Web-Weaver alchemists harvest the rare fungi and crystalline growths that form the basis of Glimmerdark potions, trading their harvests for access to surface information brought by elven traders. The Dusk Elf matriarchs maintain careful records of which Solitary Night-Cousins hold which territories, sending offerings of deep-caught fish and crystallized nectar to maintain good relations with those whose patience and perceptual gifts make them invaluable allies against incursions from above or below.\n\nAmong the other races, Bat and Arachnid Kin inspire a visceral unease that borders on phobia. Surface-dwelling humans startle at the sudden flutter of leathery wings, at the glimpse of too many eyes arranged in patterns that should not exist. Dwarves, so comfortable in deep stone, nevertheless find the Night-Cousins unsettling in ways they cannot articulate—something about the silence, the way they appear without sound and vanish without trace. Even the Sylvanweald Elves, who understand patience and shadow, maintain little contact, finding the vibration-based communication of the Night-Cousins too alien for comfortable diplomacy. The Bat and Arachnid Kin themselves have long since ceased to care. They weave their webs, they sing their silent songs, they harvest the pale mushrooms in caverns where no surface-dweller has ever walked. They watch the great powers through threads and echoes, feel the tremor of armies marching above, taste the air for the smoke of surface wars. They are not frightened. They are the dark, and the dark endures."
}