{
  "type": "Detailed information",
  "title": "The Canine Kin race",
  "content": "Canine Kin are loyalty given fur and sinew, the ancient compact between hunter and hearth written in blood and bone. Across Aethelgard they answer to many names—Wind-Singers, Hearth-Wardens, Grey-Muzzles, the Pack—but all carry the inheritance of the wolf, the fox, the great hunting hound that first pressed its nose to human fire and chose to stay. Their forms vary with lineage and climate: the loping, long-limbed runners of the Shifting Expanse, coats tawny as grassland; the stocky, thick-furred guardians of northern holds, silver-grey and ice-rimed; the brush-tailed, sharp-snouted clever-folk who navigate Argent's warrens with gossip and grin. Their ears pivot like weathervanes, catching whispers from three streets away; their noses read the morning air as others read news-sheets. Eyes of amber, copper, or warm brown hold none of the feline's cool appraisal—they meet yours openly, earnestly, already half-convinced of your worth.\n\nTheir magic is written in scent and memory. Canine Kin possess what the Halfling Luck-Singers call nose-memory, the ability to weave ephemeral impressions into enduring records. A Hearth-Warden can smell a lie before it leaves the tongue, can track a single merchant through a month-old market crowd, can close their eyes and breathe in the ghost of their great-grandsire who hunted these same hills a century past. This is not spellcraft but inheritance, the Pulse flowing through olfactory nerves into the deep, ancient brain where names are less important than essences. Their greatest elders, the Grey-Muzzles, can read the emotional history of a room simply by standing in its doorway—fear lingers like ozone, grief like cold ash, joy like sun-warmed fur. It is a magic that cannot be taught, only remembered, and it makes them the most sought-after trackers, messengers, and truth-finders in all Aethelgard.\n\nOf all the Beast Kin, none have woven themselves so deeply into the tapestry of other races as the Canine Kin. Among the Halfling Kith of the Rolling Hearth, they are not employees but family, their land-ships crewed by mixed packs of halfling and canine who have navigated the spirit-paths together for generations. A Wind-Singer pup and a halfling child raised in the same caravan know each other's dreams before they learn to read. In the Solar Imperium, they serve as couriers and border scouts, their loyalty rewarded with pensions and small land-holdings—unusual honours for non-humans. The Dwarven Hegemony employs them as avalanche-sniffers and deep-tunnel rescue teams, though grudgingly, and only after a Grey-Muzzle saved a clan-hold from suffocation by scenting a gas-leak three levels away. Even the Sylvanweald, so wary of haste and fur, accepts Canine Kin as forest-wardens along the eastern marches, for no elf can smell a dryad's distress on the wind before the blight takes root.\n\nTheir temperament is the inverse of their feline cousins: where the Sun-Stalker watches and waits, the Hearth-Warden leans in, tail wagging, already invested. They form attachments swiftly and hold them with a tenacity that outlasts romance, employment, or even death. A Canine Kin whose packmate falls in battle does not seek revenge—revenge is too cold, too distant—they simply guard the grave for a season, then find the deceased's orphaned child and offer their throat in fealty. This earnestness leads other races to underestimate them, mistaking enthusiasm for simplicity. It is a costly error. The same nose that reads the weather in a change of wind can parse the political currents of a guild hall. The same ears that pivot at a distant rabbit catch the fractional hesitation in a merchant's promise. They are not naive; they have simply decided that hope is a more practical survival strategy than cynicism. And so they run, they track, they curl at the feet of their chosen people, and they dream of scents they have not yet caught, of horizons still over the next dune."
}