{
  "type": "Detailed information",
  "title": "The Dwarven race",
  "content": "Dwarves are the bones of Aethelgard given will and voice. They stand four to five feet tall, yet their breadth of shoulder and density of muscle grant them a presence that looms larger than any height. Their skin bears the tones of deep earth—ruddy granite, pale marble, warm terracotta, or the cool grey of river stones—and their hair, worn long and elaborately braided from youth to funeral pyre, runs to every shade of fire and metal: copper, bronze, silver, and fading ash. They live three centuries or more, and their bodies age with the slow dignity of mountains, growing no less formidable in their final decades than in their prime.\n\nTheir magic is not woven from the air but carved into permanence. The dwarves practice Deep Magic, the Sigil—a craft that hammers, etches, and sings raw Pulse directly into stone and steel. A dwarven blade does not merely carry enchantment; it becomes enchantment, runes breathing faintly with each swing. Their automata, brass-and-iron constructs inscribed with geomantic cores, think in gears and remember their makers' faces. Their fortress-halls are not built but grown from living rock, sealed with ward-sigils that have held for millennia. This is not wizardry but craft-absolute, and dwarves regard the spell-slinging of humans and elves with the same bemusement they might offer a child banging on an anvil without knowing how to heat the forge.\n\nDwarven society is the clockwork of clan and hearth, wound tight and kept precise. Each dwarf is born into a clan that claims descent from a common ancestor-hold, and every clan ledger records debts, favours, and grudges in script of hammered silver. Honour is currency here, and an oath sworn on a clan-ring binds tighter than any chain. They are a people of deep laughter and deeper silence, who weep openly at a masterwork of gem-cutting and who can nurse a grudge across three centuries without letting its edge dull. Their holds beneath the Ironvein Mountains are cities of vaulted halls, magma-forges, and echoing markets where mithril and adamantine trade for rune-pledges and finely aged stone-ale.\n\nTo outsiders, dwarves appear insular, even stubborn—and they are, but no more than the mountains they inhabit. They do not trust easily, but once trust is earned, it is held as securely as their own honour. In the great game of nations, the Hegemony plays a slow, patient hand. They remember every treaty broken and every trade embargo levied against them; they also remember the holds that sent aid during the Cataclysm, and those debts have not been forgotten. Among the elder races, only elves match their memory, but dwarven memory carries more steel. They watch the human empires rise and fall with the weary satisfaction of those who have seen dynasties crumble while their own foundations held firm, and they work their forges, and they wait."
}