{
  "type": "Detailed information",
  "title": "The Elven race",
  "content": "Elves are the memory of Aethelgard made flesh, their lineage stretching back to epochs before the Cataclysm scarred the continent. Two great branches have grown from the ancient root, each bearing the fruit of that elder age in different soil. The High Elves of the Sylvanweald stand tall and slender, with skin pale as birch bark or cream, hair flowing in silver, white, or autumn-gold, and eyes that hold the colour of deep forest pools—green, amber, or twilight blue. Their cousins, the Dusk Elves of the Glimmerdark, bear skin of storm-grey, lavender, or deep indigo; hair white as salt-bone or silver-threaded obsidian; and eyes that gleam opalescent in the fungal glow, adapted to sunless realms. Both are ageless, touched by the Pulse at their making, and both regard time as a slow river rather than a rushing flood.\n\nMagic is not a study for elves—it is an inheritance. The High Elves practice High Arcanistry, a discipline of sublime precision and terrible beauty, weaving the Weave into geometries of pure, devastating thought. They do not cast spells so much as convince reality to remember a more perfect form. Their floating citadels of grown quartz, their singing groves, their enchantments that endure millennia—all are expressions of this patient mastery. The Dusk Elves, in their vast caverns of bioluminescent crystal, follow a different path. They attuned themselves to the shadows between the Weave's threads, to entropy and dream, and they call this subschool the Unraveling. Their magic whispers, erodes, insinuates; they weave shadows into cloaks, thoughts into minds, and the essences of deep-earth fungi into alchemies that can preserve or unmake.\n\nCulturally, the two branches diverge as sharply as light and twilight. The Sylvanweald Enclave is a civilization of serene stasis. They value contemplation, preservation, and the slow accumulation of knowledge. An elf might spend a century perfecting a single spell-form, or a decade in silent communion with an ancient tree. Their society is structured around houses of learning and memory-keepers, and they view the younger races with a patience that borders on sorrow—children who will burn out before they learn to read the stars. The Glimmerdark, by contrast, is a matriarchal theocracy vibrant with ambition, though ambition of a subtle kind. Its Dusk Elves revere a dreaming goddess of secrets, and their society is a web of covens, information-brokers, and artifact-hunters. They do not hoard knowledge; they trade it, thread it into bargains, and weave influence from the shadows. Where the High Elf watches and waits, the Dusk Elf watches and nudges.\n\nTo walk among elves is to feel the weight of centuries. Their speech is unhurried, their silences comfortable, their judgements slow to form but immovable once set. They are capable of great warmth and great cruelty, each measured against spans of time humans struggle to comprehend. A kindness shown to an elf may be remembered and returned a hundred years later; a slight, likewise. Among the elder races, only the dwarves match their long memory, and only the dragons exceed their age. Yet for all their power, the elves are a people in quiet crisis—their birthrates have dwindled across millennia, their ancient wards weaken, and the world they once guided now races toward futures they cannot predict. They remain beautiful, terrible, and utterly certain of their own rightness, even as the glass sphere of peace begins to show its first, fine cracks."
}