{
  "type": "Detailed information",
  "title": "The Feline Kin race",
  "content": "Feline Kin are the grace of the hunt made sentient, the patience of the predator given voice. Across Aethelgard they are known by many names—Sun-Stalkers, Shadow-Prowlers, Velvet-Paw, the Pride—but all recognize the kinship of slitted eye and silent step. Their forms range from the towering, leonine warriors of the southern savannahs, maned and heavy-maned, to the lithe, cloud-soft hunters of the northern forests, to the compact, sharp-eared prowlers who navigate Argent's rooftops as easily as its streets. Fur follows function: tawny gold for sun-baked plains, silver-grey for moonlit woodlands, deep umber for the Cinderwaste's ashen slopes, and in the Glimmerdark, rare coal-black coats that swallow light. Their eyes, amber or emerald or burning topaz, hold the vertical slit of the stalker, and their retractable claws tap an impatient rhythm against stone when thoughts run faster than words.\n\nTheir magic is not spoken but embodied. Feline Kin do not command the Pulse so much as align themselves with its oldest, wildest currents—the moment before the pounce, the breath held in perfect stillness, the sudden, devastating release. This is Hearth and Happenstance of a different flavour, one that sharpens reflexes beyond mortal limits, that muffles footfalls until they are indistinguishable from shadow, that allows a hunter to see the heat-signature of prey through fog or falsehood. Their greatest warriors enter a state they call the Still Stalk, a trance of absolute focus where time seems to thicken and each heartbeat becomes a weapon counted. It is not spellcraft as elves or humans understand it, but it is magic nonetheless, older than the Weave and hungrier.\n\nSociety among Feline Kin is structured around the Prowl, a fluid kinship unit that shifts with seasons, prey migrations, and the demands of the great nations that employ them. They do not build cities of their own, save for a few ancestral roosts in high savannah cliffs and deep-wood clearings; instead, they weave themselves into the fabric of other powers. In the Solar Imperium, Sun-Stalkers serve as elite scouts and bodyguards, their loyalty purchased with honour and fair coin, their natural talents honed into martial precision. Among the Halfling Kith, Wind-Singer Packs—canine and swift-rodent kin—fill similar roles, but Feline Kin are too independent for the Rolling Hearth's easy camaraderie. They thrive where their skills are valued and their solitude respected: as rangers on the Sylvanweald's borders, as trackers-for-hire in Argent's mercenary guilds, as silent sentinels in Glimmerdark outposts, where Veil-Wing Covens understand the value of a companion who needs no torch.\n\nThe other races regard Feline Kin with a mixture of admiration and unease. Humans praise their loyalty but startle when amber eyes fix upon them with unblinking attention. Elves respect their attunement to the wild Pulse but find their impatience with elven deliberation frankly exhausting. Dwarves employ them as tunnel-scouts, valuing senses that can detect gas seepage or goblin ambush, but mutter about cats in the larder. The Feline Kin themselves have learned to navigate this landscape of wary welcome. They do not seek acceptance; they seek contracts, fair treatment, and the right to leave when the hunt grows stale. They groom themselves in sunbeams, sharpen their claws on sanctioned posts, and watch the grand dramas of nations with the patient, unimpressed gaze of those who know that empires, like herds, eventually thin and scatter. What remains is the hunt, the prowl, the warm stone at midday. They wait, and they watch, and they are never quite tame."
}