{
  "type": "Detailed information",
  "title": "The Goblin race",
  "content": "Goblins are the spark of invention in small, wiry frames, the proof that civilization is less about size than stubbornness. They stand barely three feet at their tallest, all sharp angles and quick motions—oversized ears that swivel like weathervanes, catching every whisper of coin or conspiracy; eyes of amber, copper, or polished jet that miss nothing; fingers long and nimble, always stained with oil, soot, or the residue of half-understood alchemies. Their skin runs to moss-green, rust-brown, or the grey of stormclouds, and their voices carry a rapid, musical cadence that can make even a shopping list sound like urgent poetry. They live barely a century, yet pack each year with more scheming, salvaging, and survival than races thrice their span.\n\nMagic among goblins is not inherited, studied, or carved—it is found. They possess no innate gift for the Weave, no ancestral pacts, no runic traditions. What they have instead is an almost preternatural talent for taking magic that others have discarded, broken, or simply failed to notice, and making it work. A goblin tinker cannot forge a dwarven ward-sigil, but they can pry a fractured ward-stone from a ruined outpost, rewire its remnants with copper wire and beetle-shell resin, and coax it to keep rain off their scrap-wagon for another season. This is not theft but resurrection, and goblins practise it with the reverence of clerics and the pragmatism of pawnbrokers. Their greatest artisans are not those who create from raw materials, but those who see potential in rubbish and persuade it to become useful again.\n\nGoblin society is the art of the possible, practised collectively. They gather in warrens, junk-towns, and the undercrofts of greater cities—anywhere space is cheap and oversight minimal. Leadership is fluid, earned through cleverness rather than inheritance, and disputes are settled by whoever can invent the most convincing lie fastest or, failing that, whoever throws the sharpest bit of scrap. They have no kings, no written constitutions, and no patience for bureaucracy. What they do have is an intricate web of favours, salvage-rights, and shared custody of particularly valuable finds. A goblin who discovers a crashed skyship's arcane core does not hoard it; they call kin, and together they dismantle it before the city guard arrives, each taking components they understand, each owing the others for the rest of their brief, bright lives.\n\nIn the wider world, goblins are simultaneously indispensable and despised. Their salvage keeps the Free-City's lesser workshops humming with cheap components; their tunnels and traps made the Federation's defensive networks the envy of the Cinderwaste; their uncanny luck at finding lost things has saved more than one elven heirloom from vanishing into bog or barrow. Yet they are still chased from dwarven holds on general principle, still spoken of in human taverns as pests and pilferers, still regarded by the proud races as the world's clever cockroaches. The goblins notice this. They also notice where the dwarves store their slag-heaps, which human lords leave their postern gates unguarded, and how much a particularly insufferable elven diplomat paid for their signet ring. They say nothing. They wait. And somewhere, in a junk-shop beneath Argent's glittering towers, a goblin tinker is fitting an ancient pulse-capacitor into a chassis made of scrap brass and wishbone, and smiling."
}