{
  "type": "Detailed information",
  "title": "The Halflings race",
  "content": "Halflings call themselves the Kith of the Rolling Hearth, and they carry their homes with them wherever the spirit-paths lead. Small and softly rounded, they stand barely three feet at full height, with curls of chestnut, wheat, or russet crowning heads that tilt upward to meet the world with frank curiosity. Their feet are broad and leather-soled, adapted to long wanderings, and their hands—never still—weave, carve, or gesture as they speak. They live a century and a half, on average, yet pack each year with more laughter and lived warmth than races thrice their span. To be in their presence is to be offered tea, a story, and a seat by the fire, often before names have been exchanged.\n\nTheir magic is subtle, easily overlooked by those who expect thunder and light. The Halflings practice Luck-Singing, Hearth and Happenstance—a weaving of narrative and intent that coaxes reality toward kinder outcomes. A Luck-Singer does not command the wind; they remind it of a time it carried a sailor home. They do not curse an enemy; they simply un-weave the small fortunes that enemy took for granted. Their spells are told rather than cast, sung rather than spoken, and the most powerful among them carry tales so old that the world has forgotten it ever learned them from Halfling lips first. This magic leaves no scorch marks, no lingering auras—only the quiet certainty that something went oddly right.\n\nThe Kith are nomads by blood and preference, piloting their land-ships across the Shifting Expanse in caravans of woven wood, enchanted sailcloth, and enormous, patient draft-beasts. These vessels creak and sway across the grasslands like ships on an amber sea, following herds, seasons, and the murmured invitations of distant kin. Halfling society is decentralized, held together by oath-keeping and correspondence rather than kings or councils. They are the world's most sought-after messengers and mediators, for they remember every promise made in their hearing and possess an almost uncanny talent for finding common ground between feuding parties. They charge fair coin for these services, and also gossip, which they consider a parallel currency.\n\nAmong the great powers, Halflings occupy a curious space of tolerated affection. No nation fears their armies, for they raise none; no guild resents their competition, for they trade in information and fine craftsmanship rather than bulk goods. The elder races often dismiss them as harmless idyllists, failing to notice how many treaties were drafted on Halfling-penned parchment, how many succession crises were averted by a well-timed piece of news delivered by a Kith courier. The Halflings do not correct this underestimation. It suits them to be overlooked, to be welcomed into palaces and hovels alike as non-threatening guests who bring good bread and better stories. They watch the great powers posture and prepare for war, and they continue their slow wanderings, carrying with them the quiet, stubborn conviction that the world, given sufficient tea and patient listening, might yet choose peace."
}