{
  "type": "Detailed information",
  "title": "The Human race",
  "content": "Humankind is the youngest of the elder lineages, yet in the span of a few short millennia they have woven themselves into every corner of Aethelgard. Standing between five and six feet tall, their forms are as varied as the soils they till—skin of pale ivory, sun-bronzed ochre, deep umber, or the olive of southern coasts; hair of flax, copper, jet, or ash; eyes that mirror the sky, the forest, or the hearth-fire. Their lifespans are but a whisper to the elves, barely a century, yet each generation reshapes the world with a ferocity that older races find both reckless and enviable. They carry no innate magic in their blood; the Pulse does not sing unbidden in their veins. What they possess instead is an unquenchable hunger to understand, to master, to claim.\n\nThey are the kind that willing to adapt to everything, imitate everything, mix with everything, control, tame and own everything. It is this hunger that drove them to seize the Weave and, through centuries of discipline and experiment, bend it to mortal will. While elves attune and dwarves carve, humans study—they dissect the arcane into formulae, codify it into schools, and teach it in halls of marble and brass. The Sun Sages of the Imperium channel daylight into searing lances; in the Free-City, freelance arcanists trade spells like cargo. Human magic is not inherited but learned, not whispered but shouted from lecterns and siege towers. This democratization of power makes them unpredictable: any human with coin and wit might wield fire or illusion, and their innovation races ahead of elder caution.\n\nTheir societies are engines of ambition. Humans build empires not because they are fated, but because they refuse to accept limits. Cities sprout from river deltas and cling to mountain passes; roads stitch together former wildernesses; fleets of caravel and cog trace trade routes across the Inner Sea. They organize into bureaucracies, guilds, and legions, and they measure progress in aqueducts, printing presses, and arcane artillery. Yet this same drive fractures them. Human kingdoms rise and fall in cycles of hubris and renewal, and their wars—fought with steel and spell—are often the most bitter, for they lack the long memory that teaches patience.\n\nAmong the elder races, humans inspire a complex blend of condescension and grudging respect. Elves watch them scurry through brief lives and marvel at what they accomplish in so little time. Dwarves trade with them, wary of their fluid loyalties but admiring their craft. Halflings find them exhausting yet endearing, ever in need of a good meal and a gentle reminder to pause. To the younger races, humans are both bridge and barrier—they are the most likely to extend a hand across the species divide, and the most likely to draw a border. In the end, humanity’s greatest strength and deepest flaw are one and the same: they look at the world as it is and cannot help but imagine what it might become."
}