{
  "type": "Main information",
  "title": "The Main Races of Aethelgard",
  "content": "The main races of Aethelgard are not mere tribes or kingdoms—they are lineages carved by ancient magic, shaped by centuries of war, migration, and the very Pulse of the world. To know a people is to understand their blood, their gods, and the silent song of their creation.\n\nHumans are the youngest of the elder races, yet their ambition burns with the heat of a sun unchained. They usually stand from five to six feet tall, with lifespans barely a century, yet they reshape kingdoms in a handful of generations. Their skin runs the gamut of earth and pale clay; their hair like flax, copper, or jet. No innate magic quickens their veins, but their minds are rapacious—they seized the Weave and bent it to their will through sheer discipline. In the Solar Imperium they forge light into lances; in the Free-City they trade spells like coin. Everywhere, they are the race of tomorrow, for good and ill.\n\nElves remember the world before the Cataclysm, and they do not forget. Two great branches stretch from the root. The High Elves of the Sylvanweald are lithe and tall, with skin pale as birch, hair of silver or autumn-gold, and eyes that hold the patience of deep water. They are ageless—centuries slip past them like rain—and their High Arcanistry weaves the Weave into geometries of perfect, devastating beauty. They dwell in living citadels of grown quartz, and they guard the old secrets with serene, implacable will. Their cousins, the Dusk Elves of the Glimmerdark, fled the sun long ago. Their skin is the colour of stormcloud or lavender, their hair white as salt, their eyes opalescent in the bioluminescent gloom. They attuned themselves to shadow and whisper, mastering the Unraveling—magic of entropy, mind-thought, and alchemy drawn from the deep earth. Matriarchal and devout, they serve the dreaming goddess of secrets, and they see the surface as a tangled garden best observed from afar.\n\nDwarves are the children of stone and forge-fire. Broad of shoulder and short of stature, they bear beards from youth to pyre, often braided with clan-torc or mnemonic rings. They live three centuries or more, and their hearts beat in time with hammers. Their Deep Magic, the Sigil, does not cast spells—it carves permanence. Runes of warding, automata that think in brass, weapons that remember the hand that held them: all are born in the Ironvein Mountains. Dwarven society is a clockwork of clan debts, hearth-oaths, and grudges recorded in ledgers of hammered steel. They laugh in belches of ale and weep at the beauty of a well-cut gem.\n\nHalflings call themselves the Kith of the Rolling Hearth. Small and softly rounded, with curls of chestnut or wheat, they move through the world like leaves on a stream—never rushing, always arriving. Their lives span a century and a half, filled with song, good food, and wandering. The magic they wield is Luck-Singing: stories and hearth-tales woven into reality, coaxing chance to favour the brave or the kind. They pilot land-ships across the Shifting Expanse, bartering gossip and fine leatherwork, and they remember every oath sworn in their presence. They are the world's messengers, its mediators, and its quiet conscience.\n\nTieflings bear the blood of ancient pacts with infernal or elemental powers, but they have forged their own fire. Their skin shades from carmine to deep violet, steel-blue to ash-grey; horns spiral from their temples, and their tails express what words cannot. In the Cinderwaste, where the Federation rose from ash, they found not shame but strength. Their Blood-Rites—magic kindled from heritage and will—are raw, potent, and unapologetic. They are a people of fierce loyalty and sharper wit, who measure worth by deed, not lineage.\n\nOrcs are muscle and sinew carved for endurance. Towering above most races, they bear tusked jaws, broad noses, and skin of moss-green, slate, or sun-baked umber. Their shamans speak to the Pulse in the crack of thunder and the howl of predators, and their warriors wear scars like honours. Though the old world painted them as brutes, the Federation proved their depth: they are poets of the oral tradition, master saddlers, and keepers of the ash-gardens where fallen heroes are remembered in the bloom of flame-roses.\n\nGoblins are the spark of invention in small, wiry frames. With oversized ears that catch every whisper, eyes of amber or black, and nimble fingers always stained by tinker's oil, they thrive on the margins of grander powers—and often outsmart them. Their lifespans barely touch a century, but they pack each year with scheming and salvage. They turn scrap into clockwork, lost magic into makeshift wonders. In the Federation they are respected as sappers and scavengers; elsewhere, they are grudgingly admired for their unkillable optimism.\n\nBeast Kin are not a single race but a tapestry of tribes, each echoing a different creature of the wild. Feline Kin (Sun-Stalkers, Shadow-Prowlers) move with liquid grace, their eyes slitted, their reflexes preternatural; they serve as scouts and bodyguards from the Imperium to Argent. Canine Kin (Wind-Singers, Hearth-Wardens) are loping, loyal, with ears that catch the slightest shift in the wind; among the Halfling Kith they are cherished navigators and drovers. Cervid and Vulpine Kin (Whisper-Shells, Leaf-Dancers) possess antlered grace or brush-tails, moving as sylvan rangers and messengers for the Sylvanweald. Reptilian Kin (Scale-Scourges, Sun-Baskers) are cold-eyed, patient, their scales shimmering in desert or Cinderwaste light; they are trackers and survivalists without peer. Avian Kin (Skysight, Storm-Callers) bear plumage and hollow bones, their voices carrying half a league; they are couriers and scouts in the high towers of Argent. Ursine Kin (Stone-Backs, Grove-Guardians) are hulking, slow to anger, with the strength to bend iron; they dwell as mercenaries or hermits, respected for their implacable calm. Bat and Arachnid Kin (Veil-Wings, Web-Weavers) haunt the Glimmerdark and deep forests, their echolocation or spinnerets gifts of the shadows, serving as sentinels and alchemists. What unites the Beast Kin is the duality they carry—the instinct of the animal and the reason of the sapient, a bridge between civilization and the wild Pulse that still thrums in their blood.\n\nThese are the children of Aethelgard, but they are not its only voices. In forgotten valleys and uncharted isles, other lineages stir. Yet those who walk the cities and roads today are the shapers of the coming age—for better, or for ash."
}