{
  "type": "Detailed information",
  "title": "The Orcs race",
  "content": "Orcs are sinew, bone, and the unyielding will to endure. They tower over most other races, standing six and a half to seven feet at maturity, with broad, sloping shoulders and torsos built for sustained exertion. Their skin runs to moss-green, slate-grey, sun-baked umber, or the pale ash of volcanic slopes, often textured with ritual scars that map personal history—victories, griefs, oaths sworn in blood. Heavy brows shadow eyes of amber, crimson, or deep brown, and their lower jaws bear prominent tusks that emerge in adolescence, carved or beaded in some tribes as marks of passage. They live roughly a century and a half, though the hard life of the wastes and battlefields means few Orcs count their years by decades alone.\n\nMagic among Orcs is older than the Weave, older than the Sigil. Their shamans and spirit-speakers do not command the Pulse—they listen to it. The world speaks in thunder, in the howl of predators, in the groan of stone settling after quakes, and Orcish tradition reveres these voices. Blood-Rites exist among them as well, but of a different tenor than Tiefling inheritance: Orcs offer their own vitality to empower wards, to bless weapons, to call the spirits of ancestors into battle-witness. This is not bargain but communion, a cycle of giving and receiving between the living and the wild Pulse that thrums through all flesh, all earth, all ash. Their most revered elders are not those who have slain the most enemies, but those who have listened longest and returned with wisdom for their people.\n\nThe old world painted Orcs as brutes, and the old world lied. They are a people of rigorous oral tradition, capable of reciting genealogies eight generations deep without error. Their poetry, composed for the great drum circles of the Cinderwaste, weaves complex meters that shift with the heat of the forge-fires. They are master saddlers and leatherworkers, curing hides with techniques that render them softer than silk yet tougher than boiled leather. Their society, though scarred by centuries of displacement and war, prizes loyalty to the warband—a concept broader than mere military unit, encompassing all who share hearth and hardship. An Orc who eats at your fire owes you their shield; an Orc who shares their name with you owes you their honesty.\n\nAmong the Federation of Cinders, Orcs found the respect they were long denied. They serve as shock troops and border wardens, as ash-gardeners who tend the flame-rose groves where heroes are remembered, as forgemasters who learned from dwarven exiles and made the knowledge their own. Other races carry old prejudices like rusted chains: humans whisper of the Border Wars, elves recall Orcish warbands that raided deepwood fringes, dwarves grudgingly admit their craftsmanship but not their kinship. The Orcs themselves have grown weary of outrunning slander. They sharpen their axes, they recite their histories to their children, they watch the southern mountain passes for smoke signals from allied holds. They have survived the Cataclysm, the pogroms, the centuries of being called monsters. They are still here. That is answer enough."
}