{
  "type": "Detailed information",
  "title": "The Reptilian Kin race",
  "content": "Reptilian Kin are the cold-blooded patience and the unblinking memory of the hunt, their lineage stretching back to epochs before the elder races carved their first runes. Across Aethelgard they are known as Scale-Scourges, Sun-Baskers, Dune-Gliders, or simply the Cold-Blooded, though they rarely answer to names not spoken in their own sibilant tongues. Their forms vary with the lands they claim: the towering, frill-necked warriors of the southern deserts, hides of ochre and dun that shimmer with heat-deflecting scales; the sleek, long-muzzled swimmers of the eastern marshes, emerald and bronze, their webbed claws silent in black water; the compact, rock-hued climbers of the Cinderwaste's volcanic slopes, hides crusted with heat-resistant deposits that glow faintly in darkness. Their eyes hold the vertical slit of the patient ambusher, nictitating membranes sliding sideways to clear ash or spray, and their tongues—forked or brush-tipped—taste the air for fear, for lies, for the faint chemical signature of prey or ally. They live two centuries or more, and they do not hurry through any of them.\n\nTheir magic is the ancient memory of the world written in scale and bone. Reptilian Kin do not weave the Weave nor carve the Sigil; they instead practice what scholars of the Pulse call Blood-Recall, a reaching-back through genetic memory to the primordial epoch when the world was young and the sun closer and hotter. A Scale-Scourge shaman can close their eyes and remember the first desert, can feel in their marrow the heat of sands that have long since cooled into grasslands. This recall allows them to call upon abilities that other races mistake for sorcery—the chameleon's gift of true invisibility, not mere illusion; the basilisk's weight in the gaze that stills the hearts of smaller creatures; the slow, digestive patience that allows a wounded warrior to hibernate for months until healing completes. It is not spellcraft but inheritance, the Pulse flowing through neural pathways laid down when reptiles ruled the continents and mammals hid in burrows.\n\nSociety among Reptilian Kin is structured around the Nest and the Brood, terms that encompass far more than simple biology. A Nest is a shared territory—a sun-scoured canyon, a marsh island, a volcanic vent—claimed by multiple Broods who acknowledge common interest in its resources and defence. Broods are the units of kinship, tracing descent through the egg-clutch rather than the pair, and they maintain elaborate oral histories that reach back to the first Scale-Scourge who crawled from the primordial mud. Leadership within a Brood is determined by age and memory rather than combat; the eldest, whose recall stretches furthest into the deep past, speaks with the weight of ancestors, and younger reptiles listen with the patience of those who know they too will one day be old and heeded. They have no kings, no written laws, only the accumulated weight of precedent preserved in scales and stories.\n\nIn the wider world, Reptilian Kin have found their most secure footing within the Federation of Cinders, whose meritocracy judges by deed rather than warmth of blood. Scale-Scourge Bands serve as trackers and survival instructors, their ability to endure the Cinderwaste's brutal temperatures making them invaluable guides through the ashen plains. They teach Federation children which cactus hearts hold water and which hold poison, how to read a sandstorm's approach by the static in the air, how to sleep through the killing heat of noon and hunt in the blessed cool of night. The dwarven Hegemony employs them as deep-desert scouts along southern trade routes, respecting their endurance even as they mutter about the unsettling stillness of their gaze. The Sylvanweald Enclave maintains cautious relations with certain marsh-dwelling Broods, trading rare alchemical components harvested from swamp flora for woven goods and forged metal—but the elves find the reptilian patience unnerving, so different from their own, and visits are rare and formal.\n\nAmong the other races, Reptilian Kin inspire a complex unease. Humans appreciate their tracking skills but startle when those nictitating membranes slide across amber eyes mid-conversation. Halflings find them excellent companions on long journeys through hot climates—they require little water, complain less, and remember every twist of the trail—but miss the easy warmth of canine or feline kin. The Dusk Elves of the Glimmerdark maintain cautious trade with certain Broods who dwell in volcanic tunnels that connect to their deeper realms, trading heat-resistant ores for shadow-touched fungi. The Reptilian Kin themselves remain largely indifferent to this unease. They have outlasted warmer bloodlines before; they will outlast these. They bask on sun-warmed stones at the edges of civilization, tasting the air for changes, remembering older worlds, and waiting with the patience of those who know that empires, like seasons, eventually cool and pass."
}