{
  "type": "Detailed information",
  "title": "The Tieflings race",
  "content": "Tieflings are the living testament that ancient bargains cast long shadows. Their blood carries the echo of pacts struck between mortal ambition and immortal fire—pacts with infernal powers, elemental princes, or older, nameless entities that dwell in the spaces between worlds. This heritage marks them unmistakably: skin of deep carmine, violet steel, ash-grey, or the blue-black of a lightning storm at twilight; horns that spiral from temples in patterns as individual as fingerprints; tails that curl with emotion, lashing in anger or twitching in contemplation. Their eyes hold solid sclera of gold, crimson, or obsidian, and their lifespans stretch to a century and a half, though few Tieflings expect to die in old age.\n\nMagic in Tiefling veins is not learned nor carved—it is remembered. They practice Blood-Rites, a tradition of tapping the inherited essence of their pact-ancestors through ritual, sacrifice, and will. A Tiefling need not study the Weave to call flame to their palm; they need only reach back into the marrow, into the moment some forebear shook hands with a burning lord and said yes. This power is raw, ungoverned by academic formulae, and it manifests differently in each individual: one might exhale cinders in anger, another step through shadows, another whisper secrets that cause iron to rust. It is a demanding inheritance, one that exacts tolls of exhaustion or blood, but it cannot be taken away.\n\nThe Federation of Cinders rose from the ash of what the old kingdoms called the mongrel races. Tieflings, Orcs, Goblins, and outcast Beast Kin scraped survival from the Cataclysm's scorched cradle and forged something unprecedented: a meritocracy built not on lineage but on deed. In the Cinderwaste, a Tiefling's heritage is neither shame nor currency—it simply is. They serve as Blood-Rite battle-mages, as ash-scribes who record Federation law in heat-resistant steel, as elemental-binders who coax fire and stone into service for their stark, functional cities. Their society values competence, candor, and the fierce protection of their hard-won sovereignty. They do not forgive slights easily, but they forgive old bloodlines even less.\n\nTo the other races, Tieflings evoke a complex unease. Humans see the remnants of pacts they have outlawed and secretly study. Elves perceive a corruption of natural order, though the Dusk Elves trade cautiously with them, recognizing kindred spirits in those who walk shadowed paths. Dwarves respect their craftsmanship with heat and forge-work but remain wary of their volatile tempers. Halflings, characteristically, judge by character rather than ancestry and often find Tieflings to be loyal, dry-witted companions once the initial wariness thaws. The Tieflings themselves have grown past seeking acceptance. They hold their heads high in the Free-City markets and the Imperium's border towns, horns catching the light, tails still, watching. They are the children of old sins, but they have built their own virtue from ash and iron, and they will not be shamed into vanishing."
}