{
  "type": "Main information",
  "title": "The Beasts of Aethelgard",
  "content": "The Beasts of Aethelgard: Creatures of Fur, Scale, and Pulse\n\nThe world teems with life that would feel familiar to any traveler from Earth—horses thundering across plains, cattle lowing in barns, sheep dotting hillsides with their woolly patience. Dogs guard flocks and hearths in every nation, their breeds as varied as the cultures that shaped them. Cats prowl granaries and temples, indifferent to the worship of those who feed them. Wolves hunt in forests that span continents, their howls stitching night to morning. Deer startle at forest edges, rabbits burrow in meadows, hawks wheel above open country, fish silver the rivers and seas. This is the baseline of life, the shared inheritance of a world that followed similar evolutionary paths, and sentient races rely upon these creatures as Earth's peoples do—for food, for labor, for companionship, for the simple comfort of their presence.\n\nYet the Pulse flows through all living things, and in some creatures it flows stronger, shaping them into forms and behaviors that transcend earthly expectation. These are not monsters in the sense of being inherently hostile—though many are dangerous—but expressions of magic's influence on biology, creatures that have adapted to a world where reality itself breathes.\n\n**Pulse-Touched Beasts** are common creatures altered by prolonged exposure to concentrated magic. A wolf that dens near a ley line convergence may grow to twice normal size, its fur taking on an iridescent sheen, its howl carrying supernatural terror or comfort depending on its mood. Deer that graze in ancient groves sometimes develop antlers that glow faintly at night, attracting mates and predators in equal measure. Ravens in the Sylvanweald speak words they have overheard, not understanding but mimicking with uncanny accuracy, and travelers learn to guard their tongues near raven-haunted places. These creatures are not fundamentally different from their mundane cousins—they breed true with normal members of their species, their offspring sometimes touched, sometimes not—but they are treated with wary respect, for a Pulse-touched bear is no more malicious than an ordinary bear, but far more capable of acting on its malice.\n\n**Dire Beasts** represent a more extreme divergence, creatures that have evolved entirely in response to magical pressures. Dire wolves pack the northern forests of Vintergard, their shoulders reaching the height of a tall man's chest, their fur so thick that arrows often fail to penetrate. They hunt with the tactical intelligence of orc warbands, and some woods-wise rangers claim they communicate through patterns of howls that constitute a crude language. Dire bears in the Ironvein foothills can shatter dwarven defensive doors with single blows, and their hides are prized for armor that turns blades as easily as ordinary leather turns rain. Dire boars, their tusks wreathed in faint, phosphorescent glow, charge through Cinderwaste ash with berserk fury, and hunting one is a rite of passage for young Federation warriors. These creatures are apex predators in their territories, and while they can be fought and killed, the wise give them wide berth.\n\n**Magical Specializations** have produced creatures with abilities no earthly animal could possess. The glimmer-spiders of the Glimmerdark weave webs that glow with captured bioluminescence, their silk sought by Dusk Elf alchemists for its light-storing properties and by surface weavers for its unearthly beauty—though harvesting it requires negotiating with the spiders, who are intelligent enough to distinguish trade from theft. Fire-bats of the Cinderwaste consume volcanic gasses and exhale heat, their colonies warming caverns that would otherwise be uninhabitable, and Federation settlements near such colonies have learned to leave offerings of sulfur in exchange for the bats' tolerance. Frost-snakes of Vintergard leave trails of ice behind them as they move, their bodies so cold that contact means instant frostbite; Dusk Elf hunters track them for their scales, which are woven into cloaks that render the wearer invisible to heat-sensitive predators.\n\n**The Great Herds** of the Shifting Expanse deserve particular mention, for they are not beasts but moving ecosystems. Vast herds of six-legged grazers called thunderbeasts migrate across the grasslands in numbers that darken the horizon, their footfalls audible from miles away. They are not aggressive, but they are also not stoppable; a thunderbeast herd will simply walk through anything in its path, and the Halfling Kith have learned to read their movements as farmers read weather, scheduling their own migrations to avoid or accompany the herds as circumstance dictates. Accompanying the thunderbeasts are predator packs—dire wolves, great cats, and stranger things—that cull the weak and old, and following both are scavengers that clean what remains. The entire ecosystem moves together, a living tide of flesh and hunger that has crossed the Expanse since before the first halfling built the first land-ship.\n\n**Domestication and Use** varies by region and creature. The Solar Imperium breeds warhorses with minor enchantments woven into their bloodlines, producing mounts that do not shy from fire or the smell of blood, that can maintain a gallop for hours beyond natural endurance. The Dwarven Hegemony trains tunnel-haunts, large lizard-like creatures native to the deep places, as pack animals in passages too narrow for ponies and too treacherous for unsupervised travel. The Federation of Cinders has domesticated the ash-strider, a flightless bird tall enough to ride, whose legs are sheathed in heat-resistant scales and whose eggs provide protein in a land where little else grows. The Halfling Kith maintain symbiotic relationships with several species of herd animals, neither fully domesticated nor fully wild, that follow the land-ships and provide milk, wool, and occasional meat in exchange for protection from the worst predators.\n\n**The Truly Dangerous** are those creatures that actively hunt sentient beings, not out of malice but because sentient beings are prey. The manticores of the southern Kharakun jungles combine leonine bodies, bat-like wings, and scorpion tails, and they have learned that caravans are easier to hunt than wild herds. Chimeras, rare but devastating, are said to be created when magic goes wrong in living creatures, combining incompatible parts into forms that should not exist and cannot survive long—but while they live, they kill with the desperate fury of things that know they should not be. The undead, though not truly beasts, haunt places where the Cataclysm's wounds run deep—skeletons that rise from mass graves, shades that cling to ruins, ghouls that were once people and now remember only hunger. These are not natural, and they are treated not as animals to be understood but as cancers to be excised.\n\n**Observation and Wonder** remain the proper responses to most of Aethelgard's beasts. The world is old, and life has had time to experiment. A traveler might glimpse a unicorn in the Sylvanweald's deepest groves—not the gentle creatures of children's tales, but wild things of pure magic, their horns holding power over life and death, their tempers as sharp as their beauty. A sailor might spot a sea serpent breaching far from shore, its scales catching sunlight like scattered gems, and count themselves fortunate to see it at such distance. A miner might break through into a cavern where crystal snakes dwell, their bodies translucent, their movements silent, their gaze carrying no threat—only the ancient, indifferent curiosity of things that have never learned to fear.\n\nThe beasts of Aethelgard are not monsters to be slain for experience or treasure, though both can be harvested from them. They are fellow travelers on a living world, shaped by the same Pulse that flows through elf and dwarf and human, deserving of the same respect any sentient race extends to forces it cannot fully control. The wise hunter takes only what they need. The wise farmer builds fences strong enough to deter the curious but not so strong as to bar passage entirely. The wise traveler watches, learns, and gives thanks that in a world of wonders, most wonders are content to simply be, without demanding anything from those who share their world."
}